{
  "updated": "2025-12-31T09:46:10+00:00",
  "items": [
    {
      "id": "4d72159c55bd42b5",
      "title": "Our 2025 NFL All-Rookie Team: We picked standout first-years at every single position",
      "link": "https://espn.com/nfl/story/_/id/47435284/2025-nfl-all-rookie-team-every-position-carson-schwesinger-cam-ward-tetairoa-mcmillan",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-12-31T07:10:42+0000",
      "summary": "We know Carson Schwesinger makes the list at LB, but is Cam Ward or Tyler Shough the QB1? Let's build first- and second-team NFL All-Rookie rosters."
    },
    {
      "id": "173037d8dd89803d",
      "title": "Colts add intriguing cornerback to practice squad",
      "link": "https://stampedeblue.com/indianapolis-colts-news/119980/colts-add-intriguing-cornerback-to-practice-squad",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-12-31T03:39:42+0000",
      "summary": "The Indianapolis Colts announced on Tuesday that the team signed cornerback Wyett Ekeler to their practice squad and waived offensive tackle Zach Thomas in a corresponding roster move. Ekeler is well known for being the younger half-brother of former All-Pro NFL running back Austin Ekeler, who is currently playing for the Washington Commanders. The two [&#8230;]"
    },
    {
      "id": "5779a12649315351",
      "title": "Sources: Colts to start Leonard over Rivers at QB",
      "link": "https://espn.com/nfl/story/_/id/47453736/colts-expected-start-qb-riley-leonard-finale-sources-say",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-12-31T03:11:24+0000",
      "summary": "The Colts are expected to start rookie quarterback Riley Leonard on Sunday against the Texans, sources told Stephen Holder and Jeremy Fowler on Tuesday."
    },
    {
      "id": "b50ca60a6f78b1d8",
      "title": "Rams QB Stafford into 6th in NFL passing yards",
      "link": "https://espn.com/nfl/story/_/id/47450639/stafford-eclipses-roethlisberger-sixth-passing-yards",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-12-31T03:11:24+0000",
      "summary": "Rams quarterback Matthew Stafford passed former Steelers quarterback Ben Roethlisberger for sixth on the NFL's all-time passing yards list."
    },
    {
      "id": "3e26ba44793a1914",
      "title": "🏆 Tracking the playoff picture and the draft order",
      "link": "https://espn.com/espn/feature/story/_/id/47248728/2025-nfl-playoff-live-odds-updated-chances-clinch-bracket-projections-scenarios",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-12-31T03:11:23+0000",
      "summary": "We are following the 2025 NFL season's playoff picture. Here's how things look right now for wild-card spots, division races and even the draft order."
    },
    {
      "id": "aa51cd45af0cc32b",
      "title": "Riley Leonard set to make first NFL start, while becoming Colts’ 8th different season finale starter in last 8 seasons",
      "link": "https://stampedeblue.com/indianapolis-colts-news/119972/riley-leonard-set-to-make-first-nfl-start-while-becoming-colts-8th-different-season-finale-starter-in-last-8-seasons",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-12-30T22:00:20+0000",
      "summary": "The final chapter of the Indianapolis Colts 2025 campaign will be written by a 23-year-old rookie making his first NFL start. When rookie quarterback Riley Leonard takes the field on Sunday against the Houston Texans, he will become the Colts’ eighth different season finale starter in the last eight seasons. The list of eight starters [&#8230;]"
    },
    {
      "id": "69f99e92824f64b8",
      "title": "How to watch the Indianapolis Colts at Houston Texans on January 4, 2026",
      "link": "https://colts.com/news/how-to-watch-colts-at-texans-week-18-2025",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-30T21:34:23+0000",
      "summary": "TV broadcast, radio and streaming information for Indianapolis Colts at Houston Texans on Sunday, January 4 at 1:00 p.m. ET (Week 18)."
    },
    {
      "id": "0cb4989510cbaf1d",
      "title": "Colts release unofficial depth chart for Week 18 game vs. Houston Texans",
      "link": "https://colts.com/news/colts-release-unofficial-depth-chart-for-week-18-game-vs-houston-texans-philip-rivers-riley-leonard",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-30T19:57:47+0000",
      "summary": "The Colts released their unofficial depth chart ahead of their Week 18 game against the Houston Texans at NRG Stadium. Check it out below:"
    },
    {
      "id": "8b23e542fb6086fa",
      "title": "NFL futures: Seahawks enter Week 18 as Super Bowl favorites",
      "link": "https://espn.com/espn/betting/story/_/id/43748901/super-bowl-2026-odds-win-nfl-betting",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-12-30T19:26:56+0000",
      "summary": "Updated 2025 NFL win totals and odds for every team to make the playoffs, win their division, conference and Super Bowl LX."
    },
    {
      "id": "92c821d90e4b2cb7",
      "title": "NFL playoff schedule, projected bracket: Here's what to know in both conferences",
      "link": "https://espn.com/nfl/story/_/id/47440678/nfl-playoff-schedule-bracket-afc-nfc-tv-dates-locations-2026",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-12-30T18:54:59+0000",
      "summary": "The NFL playoffs begin on Jan. 10 with three full rounds before Super Bowl LX on Feb. 8. Here is the full schedule and the projected bracket."
    },
    {
      "id": "e243a5ac43bcbc0c",
      "title": "Updated NFL Power Rankings: New 1-32 poll, plus what we learned about each team this season",
      "link": "https://espn.com/nfl/story/_/id/47446909/nfl-week-18-power-rankings-poll-32-teams-2025-season-lessons",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-12-30T18:54:42+0000",
      "summary": "Let's update our NFL Power Rankings one more time ahead of Week 18. We also picked out lessons for all 32 teams in 2025."
    },
    {
      "id": "a16d75cef6d69682",
      "title": "Colts special teams coordinator Brian Mason weighs in on Adam Vinatieri's Hall of Fame candidacy: 'Greatest kicker of all time'",
      "link": "https://colts.com/news/colts-special-teams-coordinator-brian-adam-vinatieri-hall-of-fame-candidacy-finalist-2026-greatest-kicker-of-all-time",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-30T18:37:10+0000",
      "summary": "Vinatieri was named a finalist for the Pro Football Hall of Fame Class of 2026 on Tuesday."
    },
    {
      "id": "0244cad596da5386",
      "title": "Colts sign CB Wyett Ekeler to practice squad, release T Zach Thomas from practice squad",
      "link": "https://colts.com/news/colts-sign-cb-wyett-ekeler-to-practice-squad-release-t-zach-thomas-from-practice-squad",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-30T18:34:09+0000",
      "summary": "The Colts made the roster moves on Tuesday."
    },
    {
      "id": "578f1924219a1b96",
      "title": "Source: Colts starting rookie Riley Leonard at Houston",
      "link": "https://fox59.com/sports/colts/source-colts-starting-rookie-riley-leonard-at-houston/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-30T16:30:51+0000",
      "summary": "INDIANAPOLIS – The football’s in Riley Leonard’s hands. The rookie quarterback will make his first career start Sunday when the Indianapolis Colts close their disappointing season at Houston, according to a source with knowledge of the situation. Coach Shane Steichen said Monday there would be internal discussions regarding whether to stick with veteran Philip Rivers [...]"
    },
    {
      "id": "e0099bbf2f9ef5e7",
      "title": "How all 17 weeks of the NFL season led us here: Barnwell sorts what mattered and what didn't",
      "link": "https://espn.com/nfl/story/_/id/47434363/2025-nfl-week-17-barnwell-mattered-season-schedule-impactful-games-playoff-races",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-12-30T16:28:27+0000",
      "summary": "Bill Barnwell picked out what most impacted the playoff hunt across the entire season, from the Lions' dud in Week 1 to the Steelers' struggles Sunday."
    },
    {
      "id": "3f77caf5418847f0",
      "title": "Reggie Wayne, Adam Vinatieri named finalists for Pro Football HoF’s 2026 class",
      "link": "https://stampedeblue.com/indianapolis-colts-news/119961/reggie-wayne-adam-vinatieri-named-finalists-for-pro-football-hofs-2026-class",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-12-30T16:19:27+0000",
      "summary": "Indianapolis, IN — A pair of former Indianapolis Colts legends — wide receiver Reggie Wayne and kicker Adam Vinatieri — were announced as finalists for the Pro Football Hall of Fame’s 2026 Class. With fifteen total modern-era finalists in the equation, there are caveats and rules in place to ensure a seamless operation. Below is [&#8230;]"
    },
    {
      "id": "f5b4dc50f6d14800",
      "title": "Open letter to Carlie Irsay-Gordon: It’s time for a reset",
      "link": "https://stampedeblue.com/indianapolis-colts-analysis/119916/open-letter-to-carlie-irsay-gordon-its-time-for-a-reset",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-12-30T15:30:00+0000",
      "summary": "This was the season it was finally supposed to change. The Colts had found a leader in Daniel Jones, a true starting quarterback. The offense was clicking, Jonathan Taylor was an MVP-candidate, the defense was doing much better, and the Colts were not only winning games, but destroying opponents, climbing to an AFC leading 7-1 [&#8230;]"
    },
    {
      "id": "2017dc16f8ac7c19",
      "title": "The good, bad and ugly of Week 17: Big wins for Falcons, Niners, Eagles, but what happened to Steelers, Bucs and Packers?",
      "link": "https://espn.com/nfl/story/_/id/47401706/nfl-week-17-2025-season-questions-takeaways-lessons-stats-recap-every-game",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-12-30T15:24:47+0000",
      "summary": "Our NFL Nation reporters answer big questions from each Week 17 game. Here's what you need to know."
    },
    {
      "id": "e8ffe6e6e6f79c0d",
      "title": "Rookie QB Riley Leonard to start in Colts season finale",
      "link": "https://stampedeblue.com/indianapolis-colts-news/119952/rookie-qb-riley-leonard-to-start-in-colts-season-finale",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-12-30T14:57:08+0000",
      "summary": "Indianapolis, IN — The Indianapolis Colts are turning to rookie quarterback Riley Leonard in their final game of the season against the Houston Texans, according to ESPN’s Jeremy Fowler. After three games of the Philip Rivers off the couch experiment, a last-ditch effort that provided a good story if nothing else, it’s the rookie’s time [&#8230;]"
    },
    {
      "id": "203c04e471c25d28",
      "title": "Colts greats Adam Vinatieri, Reggie Wayne among 15 finalists for Pro Football Hall of Fame Class of 2026",
      "link": "https://colts.com/news/colts-greats-adam-vinatieri-reggie-wayne-among-15-finalists-for-pro-football-hall-of-fame-class-of-2026",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-30T14:00:09+0000",
      "summary": "Vinatieri is in his second year of Hall of Fame eligibility, while Wayne has been named a finalist now in each of his seven years of eligibility."
    },
    {
      "id": "c2d5faf06ea43400",
      "title": "Colts standouts Reggie Wayne, Adam Vinatieri among 15 modern-era finalists for Hall of Fame Class of 2026",
      "link": "https://fox59.com/sports/colts/colts-standouts-reggie-wayne-adam-vinatieri-among-15-modern-era-finalists-for-hall-of-fame-class-of-2026/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-30T14:00:00+0000",
      "summary": "INDIANAPOLIS – Reggie Wayne and Adam Vinatieri are once again knocking on the door in Canton, Ohio. The two long-time Indianapolis Colts’ standouts are among 15 modern-era Finalists for the Pro Football Hall of Fame’s Class of 2026. Wayne, one of the most prolific receivers in NFL history, has reached the final 15 in each [...]"
    },
    {
      "id": "d4d27c869da83059",
      "title": "Two vulnerable NFL sack records: Tracking pace for Myles Garrett (22!), Broncos' D (64!)",
      "link": "https://espn.com/nfl/story/_/id/47100067/tracking-sacks-record-cleveland-browns-myles-garrett-denver-broncos-pace-nfl-single-season-player-team",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-12-30T12:13:04+0000",
      "summary": "The Browns' vet edge rusher and Denver's defense have one week to rewrite the single-season sacks record book."
    },
    {
      "id": "138c930557d022e4",
      "title": "The Colts face a major decision with Michael Pittman Jr.’s contract",
      "link": "https://stampedeblue.com/indianapolis-colts-analysis/119920/the-colts-face-a-major-decision-with-michael-pittman-jr-s-contract",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-12-30T12:00:00+0000",
      "summary": "There are certain conversations NFL teams don’t want to have, but are forced into anyway. The Colts’ situation with Michael Pittman Jr. is one of them. Pittman is a good player, a respected leader, and someone who has done everything asked of him since arriving in Indianapolis. This isn’t about questioning his toughness or professionalism. [&#8230;]"
    },
    {
      "id": "cfdedd6466c1cd23",
      "title": "Colts head coach Shane Steichen hasn’t discussed job status with ownership yet",
      "link": "https://stampedeblue.com/indianapolis-colts-news/119936/colts-head-coach-shane-steichen-hasnt-discussed-job-status-with-ownership-yet",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-12-30T05:04:53+0000",
      "summary": "According to head coach Shane Steichen, he hasn’t had conversations yet regarding his coaching future with team owner and CEO Carlie Irsay-Gordon yet, but the two organizational leaders continue to chat weekly (via 1075 The Fan’s Kevin Bowen): Honestly, this isn’t exactly surprising given that the Colts still have one game of football left to [&#8230;]"
    },
    {
      "id": "74cf539d716dd10b",
      "title": "Colts taking ‘wait-and-see’ approach for activating QB Anthony Richardson off IR before finale",
      "link": "https://stampedeblue.com/indianapolis-colts-news/119932/colts-taking-wait-and-see-approach-for-activating-qb-anthony-richardson-off-ir-before-finale",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-12-30T04:41:36+0000",
      "summary": "According to head coach Shane Steichen, the Indianapolis Colts are taking a ‘wait-and-see’ approach with 3rd-year quarterback Anthony Richardson regarding whether he’ll be activated off of injured reserve ahead of the team’s regular season finale game on the road against the Houston Texans (per The Athletic’s James Boyd). Specifically, given that Richardson is still experiencing [&#8230;]"
    },
    {
      "id": "825b6c8a9f9f8b25",
      "title": "ESPN NFL Insider believes Colts are ‘banking on’ free agent QB Daniel Jones being back",
      "link": "https://stampedeblue.com/indianapolis-colts-news/119925/espn-nfl-insider-believes-colts-are-banking-on-free-agent-qb-daniel-jones-being-back",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-12-30T04:13:11+0000",
      "summary": "According to ESPN’s Adam Schefter on ‘The Pat McAfee Show,’ he believes that the Indianapolis Colts are “banking on” injured pending free agent starting quarterback Daniel Jones “being back.” Specifically, it’s Schefter’s opinion right now that the two sides will reach agreement on a new contract, and Jones will be ready for the start of [&#8230;]"
    },
    {
      "id": "920d0365258f3cc9",
      "title": "Colts announce signing of practice squad quarterback",
      "link": "https://stampedeblue.com/indianapolis-colts-news/119922/colts-announce-signing-of-practice-squad-quarterback",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-12-30T03:44:16+0000",
      "summary": "On Monday, the Indianapolis Colts announced that the team has signed former Jacksonville Jaguars quarterback Seth Henigan to the team’s practice squad. Henigan had reportedly tried out for the Colts a few weeks ago. The listed 6,‘3”, 215 pound quarterback was signed as an undrafted free agent out of Memphis by the Jaguars this past [&#8230;]"
    },
    {
      "id": "a8fbd4f961173739",
      "title": "Colts’ Laiatu Latu: Late-season fade frustrating, depressing",
      "link": "https://fox59.com/sports/colts/colts-laiatu-latu-late-season-fade-frustrating-depressing/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-29T22:46:56+0000",
      "summary": "INDIANAPOLIS – The emotions were raw, and the byproduct of another season that’s gone so very wrong. Even though Laiatu Latu and Bernhard Raimann were discussing various topics via a Zoom conference call, each battled to keep his frustrations in check a day after the Indianapolis Colts’ death spiral continued with a sixth consecutive loss [...]"
    },
    {
      "id": "4df0420e2dd3fc04",
      "title": "Bill Brooks' Breakdown: How NFL teams stay motivated even when they're out of playoff contention",
      "link": "https://colts.com/news/bill-brooks-breakdown-colts-nfl-teams-competition-motivation-playoffs-philip-rivers-quarterback",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-29T20:55:56+0000",
      "summary": "Colts Ring of Honor wide receiver Bill Brooks offers his perspective on how the Colts are staying motivated to compete in the final games of the season despite being out of playoff contention. He also gives his insight into what Philip Rivers' presence in the Colts locker room has done for not just the team, but for all NFL players and fans."
    },
    {
      "id": "188a412f98df549c",
      "title": "Colts add rookie QB Seth Henigan to PS; Riley Leonard to start at Houston?",
      "link": "https://fox59.com/sports/colts/colts-add-rookie-qb-seth-henigan-to-ps-riley-leonard-to-start-at-houston/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-29T18:14:51+0000",
      "summary": "INDIANAPOLIS – A domino fell indicating Philip Rivers has played his final game after 18 seasons. The Indianapolis Colts signed rookie quarterback Seth Henigan to their practice squad Monday, which likely paves the way for rookie Riley Leonard to make his first career start in Sunday’s season finale at Houston and Rivers to watch from [...]"
    },
    {
      "id": "66fb6719abaa9561",
      "title": "Colts sign QB Seth Henigan to practice squad",
      "link": "https://colts.com/news/colts-sign-qb-seth-henigan-to-practice-squad",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-29T16:28:56+0000",
      "summary": "The Colts made the roster move on Monday."
    },
    {
      "id": "386a595e5740e5c3",
      "title": "Around the AFC South: Titans QB Cam Ward continues to grow into reliable starter, Texans win eighth straight",
      "link": "https://colts.com/news/around-the-afc-south-titans-qb-cam-ward-continues-to-grow-into-reliable-starter-texans-win-eighth-straight",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-29T14:59:33+0000",
      "summary": "The Colts play the Texans at 1 pm on Sunday, Jan. 4 at NRG Stadium."
    },
    {
      "id": "bce403177826e1b8",
      "title": "5 Colts Things: Digesting how Colts went from 8-2 to missing playoffs in 2025",
      "link": "https://colts.com/news/5-colts-things-digesting-how-colts-went-from-8-2-to-missing-playoffs-in-2025",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-29T13:45:49+0000",
      "summary": "The Colts' 23-17 loss to the Jacksonville Jaguars was their sixth in a row, and they were officially eliminated from the playoffs even before kicking off in Week 17."
    },
    {
      "id": "48bfa1cc87f4d8b1",
      "title": "Colts Blue Zone Podcast 452: Colts Lose to Jags, Fall to 8-8",
      "link": "https://fox59.com/sports/colts/colts-blue-zone-podcast-452-colts-lose-to-jags-fall-to-8-8/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-29T12:03:51+0000",
      "summary": "After looking like one of the NFL's best teams for half the season, the Indianapolis Colts completed their collapse by missing the playoffs. A loss to the Jacksonville Jaguars dropped Indy to 8-8. Not even Philip Rivers' headline-making return could stop the Colts' slide. Matt Adams recaps the game in the latest Blue Zone Podcast. [...]"
    },
    {
      "id": "19ff180bf596bc78",
      "title": "Colts' Week 18 game at Houston Texans to kick off at 1pm on Sunday, Jan. 4",
      "link": "https://colts.com/news/colts-week-18-game-at-houston-texans-to-kick-off-at-1pm-on-sunday-jan-4",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-29T04:41:25+0000",
      "summary": "The NFL announced its Week 18 schedule Sunday night."
    },
    {
      "id": "ba6e4b46b0d6b845",
      "title": "Colts’ Philip Rivers: If Sunday was his final start (again), ‘it’s been a blast’",
      "link": "https://fox59.com/sports/colts/colts-philip-rivers-if-sunday-was-his-final-start-again-its-been-a-blast/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-29T00:56:55+0000",
      "summary": "INDIANAPOLIS – It’s been a while, but we’ve been here before. A veteran quarterback with a resume worthy of Canton, Ohio, makes his final start of the season and walks out of a stadium tunnel into retirement. That was Philip Rivers five years ago at Bills Stadium in Orchard Park, N.Y. And that was Philip [...]"
    },
    {
      "id": "756055f3a17e1e8b",
      "title": "If Week 17 was Philip Rivers' final game, Colts teammates deeply appreciate, never forget 44-year-old QB's willingness to help in 2025",
      "link": "https://colts.com/news/if-week-17-was-philip-rivers-final-game-colts-teammates-deeply-appreciate-never-forget-44-year-old-qb-s-willingness-to-help-in-2025",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-28T23:09:21+0000",
      "summary": "Shane Steichen said he'll decide on the Colts' starting quarterback for their season finale on Tuesday prior to Week 18's game against the Houston Texans at NRG Stadium."
    },
    {
      "id": "a16a2c9eaebd3f28",
      "title": "Colts 'played it safe' in holding Sauce Gardner out during second half vs. Jaguars",
      "link": "https://colts.com/news/colts-played-it-safe-in-holding-sauce-gardner-out-during-second-half-vs-jaguars",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-28T22:33:02+0000",
      "summary": "Gardner left the third quarter of Sunday's game with a calf injury and did not return."
    },
    {
      "id": "7525879b6ddbd517",
      "title": "Colts hang tough, but Jaguars do enough for 23-17 win",
      "link": "https://fox59.com/sports/colts/colts-hang-tough-but-jaguars-do-enough-for-23-17-win/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-28T21:09:21+0000",
      "summary": "INDIANAPOLIS — Playing for just pride, the Indianapolis Colts gave the division-leading Jacksonville Jaguars all they could handle on Sunday at Lucas Oil Stadium, but dropped their sixth straight game, 23-17. The Colts knew their playoff fate before even taking the field on Sunday. The Houston Texans' 20-16 win over the Los Angeles Chargers on [...]"
    },
    {
      "id": "0e07449814cedf6a",
      "title": "Colts lose final home game of 2025 to Jacksonville Jaguars",
      "link": "https://colts.com/news/colts-lose-final-home-game-of-2025-to-jacksonville-jaguars",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-28T21:07:35+0000",
      "summary": "The Colts dropped their sixth straight game with the 23-17 loss."
    },
    {
      "id": "67203a4e8b74af1b",
      "title": "Keys to the Game: Colts vs. Jaguars",
      "link": "https://fox59.com/sports/colts/keys-to-the-game-colts-vs-jaguars/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-28T17:14:40+0000",
      "summary": "INDIANAPOLIS - The Texans' win over the Chargers on Saturday night officially eliminated the Colts from playoff contention, so they'll be playing for pride against the Jaguars on Sunday. IndyStar Colts' insider Joel A. Erickson gives his keys to the Colts' snapping the five-game losing streak that cost them the chance at their first postseason [...]"
    },
    {
      "id": "99cf00ec617f66ad",
      "title": "Sideline to Sideline: Bucket List Event",
      "link": "https://fox59.com/sports/colts/sideline-to-sideline-bucket-list-event/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-28T17:13:58+0000",
      "summary": "INDIANAPOLIS - Every week Blue Zone's Chris Widlic asks the Colts one question on one topic as they walk \"sideline to sideline\". This week Chris asks the players what their bucket list sporting event is they would like to attend."
    },
    {
      "id": "eda8310098e71491",
      "title": "Colts announce 6 inactive players for Week 17 game vs. Jacksonville Jaguars",
      "link": "https://colts.com/news/colts-announce-6-inactive-players-for-week-17-game-vs-jacksonville-jaguars",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-28T16:30:31+0000",
      "summary": "The Colts on Saturday placed DT DeForest Buckner, TE Drew Ogletree and WR Anthony Gould on injured reserve."
    },
    {
      "id": "3e4de0b3ebc24af8",
      "title": "How to watch the Jacksonville Jaguars at Indianapolis Colts on December 28, 2025",
      "link": "https://colts.com/news/how-to-watch-jaguars-at-colts-week-17-2025",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-28T13:00:00+0000",
      "summary": "TV broadcast, radio and streaming information for Jacksonville Jaguars at Indianapolis Colts on Sunday, December 28 at 1:00 p.m. ET (Week 17)."
    },
    {
      "id": "a49a8b5386c3b0e0",
      "title": "Gifted Colts jersey survives Christmas day fire in Martinsville",
      "link": "https://fox59.com/sports/colts/gifted-colts-jersey-survives-christmas-day-fire-in-martinsville/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-28T04:52:22+0000",
      "summary": "MARTINSVILLE, Ind. — The white keys of a pink plastic piano sit dusted with ash. Kenzie Phillips, 7, only tried it out for a few minutes before it was too damaged to play. ”I like it because I always wanted one, and I wanted to play Christmas songs,” Phillips said.  Her parents, Robert and Brittany [...]"
    },
    {
      "id": "1a544e75a7b17fe6",
      "title": "Jaguars at Colts: What to watch for",
      "link": "https://fox59.com/sports/colts/jaguars-at-colts-what-to-watch-for-3/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-28T04:25:28+0000",
      "summary": "INDIANAPOLIS — Areas of interest in the Indianapolis Colts’ Sunday meeting with the Jacksonville Jaguars at Lucas Oil Stadium: *Kickoff: 1 p.m. *Broadcast: FOX59. *Spread: Jaguars by 5½. *History lesson, Part I: The Colts lead the series 28-21, and it resumes on more favorable ground. They’ve won 10 of the last 12 meetings at Lucas Oil Stadium. That includes [...]"
    },
    {
      "id": "d3b2ce92c5f07d26",
      "title": "Texans’ win over Chargers snuffs out Colts’ playoff hopes",
      "link": "https://fox59.com/sports/colts/texans-win-over-chargers-snuffs-out-colts-playoff-hopes/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-28T00:39:42+0000",
      "summary": "INDIANAPOLIS — It didn’t take a sixth consecutive loss for the Indianapolis Colts to be eliminated from the playoffs and join a dubious group. The team’s postseason drought officially reached five years Saturday when the Houston Texans defeated the Los Angeles Chargers, 20-16, at SoFi Stadium. The Colts are just the sixth team to miss [...]"
    },
    {
      "id": "f0bf83ca3ee05fe8",
      "title": "Lucas Oil's roof closed as Colts host Jaguars",
      "link": "https://fox59.com/sports/colts/lucas-oils-roof-closed-as-colts-host-jaguars/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-27T18:21:53+0000",
      "summary": "INDIANAPOLIS — The roof is closed this week as the Colts prepare to defend home turf against division rival Trevor Lawrence and the Jacksonville Jaguars. Philip Rivers and the Colts will look to rebound after losing to the 49ers 48-27 at Lucas Oil Stadium on Monday. He will attempt to lead the 8-7 Colts back [...]"
    },
    {
      "id": "7fd4dd1831a1fdaf",
      "title": "Ashton Dulin activated from IR, Gardner no longer questionable",
      "link": "https://fox59.com/sports/colts/ashton-dulin-activated-from-ir-gardner-no-longer-questionable/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-27T17:42:18+0000",
      "summary": "INDIANAPOLIS — The Indianapolis Colts are hoping for a miracle to get into the playoffs, but first, they need to overcome injuries. On Saturday, the team announced that wide receiver Ashton Dulin had been activated from the Injured Reserve list after being placed on it on Nov. 25. He is no longer listed as questionable [...]"
    },
    {
      "id": "422601a9a3dd14d2",
      "title": "Colts place DT DeForest Buckner, TE Drew Ogletree, WR Anthony Gould on injured reserve; activate WR Ashton Dulin from injured reserve; make other roster moves for Week 17",
      "link": "https://colts.com/news/colts-place-deforest-buckner-drew-ogletree-anthony-gould-injured-reserve-activate-wr-ashton-dulin-other-roster-moves-for-week-17",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-27T16:49:04+0000",
      "summary": "The Colts made the roster moves on Saturday."
    },
    {
      "id": "fad6a1027a21b955",
      "title": "Colts’ DeForest Buckner aggravates neck injury, placed on IR",
      "link": "https://fox59.com/sports/colts/colts-deforest-buckner-aggravates-neck-injury-placed-on-ir/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-26T20:20:49+0000",
      "summary": "INDIANAPOLIS – DeForest Buckner tried, but his body resisted. A cornerstone of the Indianapolis Colts’ defense will be placed on the season-ending injured reserve list after aggravating a neck injury in Monday night’s loss to the San Francisco 49ers. “It’s obviously an unfortunate situation,’’ Shane Steichen said Friday, adding the team anticipates Buckner returning for [...]"
    },
    {
      "id": "e955a91667764771",
      "title": "Colts-Jaguars preview: With playoff shot out of their hands, Colts prep for final game at Lucas Oil Stadium this season",
      "link": "https://colts.com/news/colts-jaguars-preview-with-playoff-shot-out-of-their-hands-colts-prep-for-final-game-at-lucas-oil-stadium-this-season",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-26T18:35:21+0000",
      "summary": "The Colts could be eliminated from the postseason by the time they kick off on Sunday against the Jacksonville Jaguars, but whether they will or won't be out of the playoffs didn't impact their preparation leading up to this weekend's game."
    },
    {
      "id": "d678295df121d475",
      "title": "Colts rule out C Tanor Bortolini, WR Anthony Gould, TE Drew Ogletree, DE J.T. Tuimoloau for Week 17 game vs. Jacksonville Jaguars; DT DeForest Buckner to be placed on injured reserve",
      "link": "https://colts.com/news/colts-rule-out-c-tanor-bortolini-wr-anthony-gould-te-drew-ogletree-de-j-t-tuimoloau-for-week-17-game-vs-jacksonville-jaguars-de-deforest-buckner-to-be-placed-on-injured-reserve",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-26T18:31:01+0000",
      "summary": "The Colts will be without several key players on Sunday against the Jaguars."
    },
    {
      "id": "59bd1f560a2dce6f",
      "title": "GAMEDAY ALERT: Road closures and delays expected for Colts fans",
      "link": "https://colts.com/news/indianapolis-construction-road-closures-green-bay-packers-gameday-traffic-2025",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-26T11:00:00+0000",
      "summary": "Capitol Ave southbound closure through 2026 will affect all remaining Indianapolis Colts games at Lucas Oil Stadium."
    },
    {
      "id": "f5479a3c2f3be86a",
      "title": "Practice Notebook: Bernhard Raimann listed as full participant Thursday",
      "link": "https://colts.com/news/practice-notebook-bernhard-raimann-listed-as-full-participant-thursday",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-25T20:23:36+0000",
      "summary": "The Colts did not hold a practice on Christmas day."
    },
    {
      "id": "9e92708b5e2a4d75",
      "title": "Colts’ playoff chances? So, you’re saying there’s a chance . ..",
      "link": "https://fox59.com/sports/colts/colts-playoff-chances-so-youre-saying-theres-a-chance/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-24T22:10:50+0000",
      "summary": "INDIANAPOLIS – The Indianapolis Colts’ playoff heartbeat is faint and could flatline before they step on the field Sunday at Lucas Oil Stadium against Jacksonville. Everything hinges on Houston’s Saturday road test against the Los Angeles Chargers. A Texans’ win eliminates the Colts and extends their playoff drought to five seasons, the franchise’s longest in [...]"
    },
    {
      "id": "18157ef7d1c58b9c",
      "title": "Bill Brooks' Breakdown: Looking at Philip Rivers and Alec Pierce's prime time performances in Week 16",
      "link": "https://colts.com/news/bill-brooks-breakdown-looking-at-philip-rivers-and-alec-pierce-s-prime-time-performances-in-week-16",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-24T19:14:00+0000",
      "summary": "Colts Ring of Honor wide receiver Bill Brooks looks at the impressive performances by Philip Rivers and Alec Pierce against the 49ers and what their connection means for the Colts, and offers his perspective on the team's mentality in the final two weeks of the regular season."
    },
    {
      "id": "954f091829d52bfe",
      "title": "Philip Rivers' presence providing learning opportunities for everyone in Colts locker room",
      "link": "https://colts.com/news/philip-rivers-attitude-learning-opportunities-football-colts-jonathan-taylor-alec-pierce-jim-bob-cooter",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-24T17:43:32+0000",
      "summary": "From Jim Bob Cooter to Alec Pierce and Jonathan Taylor, the Colts are taking advantage of their opportunity to learn as much as they can from the veteran quarterback."
    },
    {
      "id": "ed39dfa12141a433",
      "title": "Colts designate WR Ashton Dulin to return to practice",
      "link": "https://colts.com/news/colts-designate-wide-receiver-ashton-dulin-to-return-to-practice-week-17",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-12-24T15:58:45+0000",
      "summary": "Dulin was placed on injured reserve with a hamstring injury in Week 13."
    },
    {
      "id": "dd562e57948e5e37",
      "title": "Lou Anarumo on Colts' D vs. Niners: 'No excuse the way we played'",
      "link": "https://fox59.com/sports/colts/lou-anarumo-on-colts-d-vs-niners-no-excuse-the-way-we-played/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-12-23T23:27:28+0000",
      "summary": "INDIANAPOLIS — Roughly 13 hours later, the quick takeaway from the Indianapolis Colts’ most lopsided loss since the forgettable 2022 season was unchanged. They weren’t good enough against the San Francisco 49ers, and that was particularly true with Lou Anarumo’s defense. \"It’s such a week-to-week league,\" he said Tuesday. \"And there’s obviously no excuse the [...]"
    }
  ],
  "links": [
    {
      "label": "Schedule",
      "url": "https://www.colts.com/schedule/"
    },
    {
      "label": "Roster",
      "url": "https://www.colts.com/team/players-roster/"
    },
    {
      "label": "Depth Chart",
      "url": "https://www.espn.com/nfl/team/depth/_/name/ind/indianapolis-colts"
    },
    {
      "label": "Injury Report",
      "url": "https://www.colts.com/team/injury-report/"
    },
    {
      "label": "Fan Zone",
      "url": "https://www.colts.com/fans/"
    },
    {
      "label": "Team Shop",
      "url": "https://shop.colts.com/"
    },
    {
      "label": "Tickets",
      "url": "https://www.colts.com/tickets/"
    },
    {
      "label": "Reddit",
      "url": "https://www.reddit.com/r/Colts/"
    },
    {
      "label": "Bleacher Report",
      "url": "https://bleacherreport.com/indianapolis-colts"
    },
    {
      "label": "ESPN Team",
      "url": "https://www.espn.com/nfl/team/_/name/ind/indianapolis-colts"
    },
    {
      "label": "Yahoo Team",
      "url": "https://sports.yahoo.com/nfl/teams/ind/"
    },
    {
      "label": "PFF Team Page",
      "url": "https://www.pff.com/nfl/teams/indianapolis-colts"
    },
    {
      "label": "Pro-Football-Reference",
      "url": "https://www.pro-football-reference.com/teams/clt/"
    },
    {
      "label": "NFL Power Rankings",
      "url": "https://www.nfl.com/news/nfl-power-rankings"
    },
    {
      "label": "Stats",
      "url": "https://www.teamrankings.com/nfl/team/indianapolis-colts"
    },
    {
      "label": "Standings",
      "url": "https://www.nfl.com/standings/league/2025/REG"
    }
  ],
  "sources": [
    "Colts.com",
    "IndyStar",
    "Colts Wire",
    "Stampede Blue",
    "The Athletic",
    "ESPN",
    "Yahoo Sports",
    "Sports Illustrated",
    "CBS Sports",
    "FOX59 / CBS4"
  ]
}