{
  "updated": "2025-11-02T10:39:00+00:00",
  "items": [
    {
      "id": "0d63cb9d8c57f90c",
      "title": "How to watch the Indianapolis Colts at Pittsburgh Steelers on November 2, 2025",
      "link": "https://colts.com/news/how-to-watch-colts-at-steelers-week-9-2025",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-02T13:00:00+0000",
      "summary": "TV broadcast, radio and streaming information for Indianapolis Colts at Pittsburgh Steelers on Sunday, November 2 at 1:00 p.m. ET (Week 9)."
    },
    {
      "id": "8102b04b1d659484",
      "title": "Ready for NFL Week 9? We have sleepers, potential surprises, trends to watch and more",
      "link": "https://espn.com/nfl/story/_/id/46770440/2025-nfl-week-9-predictions-fantasy-sleepers-upsets-bets-stats-matchups",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-11-02T03:18:56+0000",
      "summary": "Will Christian McCaffrey and Sam Darnold go off? Can the Steelers upset the Colts? And could the Bills slow the Chiefs? Here's what to know for Week 9."
    },
    {
      "id": "6b6170207c1fff57",
      "title": "Tracking every NFL trade deadline move: Jaire Alexander, Michael Carter II to the Eagles",
      "link": "https://espn.com/nfl/story/_/id/46306378/2025-nfl-trade-deadline-updates-latest-news-deals",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-11-02T03:11:16+0000",
      "summary": "We're following every move before the 2025 NFL trade deadline, which passes at 4 p.m. ET on Nov. 4. Which players have changed teams?"
    },
    {
      "id": "f8dee1af207226f4",
      "title": "Our NFL trade grades: Did the Eagles fix their CB situation with Alexander, Carter?",
      "link": "https://espn.com/nfl/story/_/id/46201721/2025-nfl-trade-grades-deadline-latest-best-worst-deals",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-11-02T03:11:15+0000",
      "summary": "We're grading deals leading into the Tuesday NFL trade deadline, including the Eagles adding Michael Carter II and Jaire Alexander."
    },
    {
      "id": "65e053cd9357130a",
      "title": "Colts activate former starting CB off IR for depleted secondary ahead of Steelers game",
      "link": "https://stampedeblue.com/indianapolis-colts-news/117146/colts-activate-starting-cb-off-ir-for-depleted-secondary-ahead-of-pittsburgh-game",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-11-01T18:39:41+0000",
      "summary": "On Saturday, the Indianapolis Colts announced that they have activated cornerback Jaylon Jones off injured reserve and signed fellow cornerback Cameron Mitchell from the practice squad to the 53-man active roster. The Colts also announced that they elevated defensive end Durell Nchami and wide receiver Laquon Treadwell from the practice squad to the active roster. [&#8230;]"
    },
    {
      "id": "5eaad09ead45fbc4",
      "title": "Colts Reacts Survey Results: Week 9 at Pittsburgh Steelers",
      "link": "https://stampedeblue.com/analysis/117140/colts-reacts-survey-results-week-9-at-pittsburgh-steelers",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-11-01T18:26:21+0000",
      "summary": "The Indianapolis Colts (7-1) are one of the hottest teams in all of football, sitting atop the entire AFC. However, they’ll face arguably one of their toughest tasks yet when they travel to take on the Pittsburgh Steelers (4-3) this weekend. The Steelers are by no means a great team these days, but the Indianapolis [&#8230;]"
    },
    {
      "id": "0e6adc03ebaa400b",
      "title": "Colts at Steelers: What to watch for",
      "link": "https://fox59.com/sports/colts-at-steelers-what-to-watch-for/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-01T18:23:37+0000",
      "summary": "INDIANAPOLIS – Areas of interest in the Indianapolis Colts' Sunday meeting with the Pittsburgh Steelers in Acrisure Stadium. History lesson The Colts have won the last two meetings, but that comes with a caveat. Each has occurred at Lucas Oil Stadium. They’ve posted a win in Pittsburgh just once in more than half a century. [...]"
    },
    {
      "id": "2d775c49c3e6029c",
      "title": "Indianapolis Colts Injury Report: DE Ebukam and WR Gould Ruled OUT",
      "link": "https://stampedeblue.com/indianapolis-colts-news/117131/indianapolis-colts-injury-report-de-ebukam-and-wr-gould-ruled-out",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-11-01T18:06:58+0000",
      "summary": "The Indianapolis Colts today released their Friday injury report for Week 9 of the NFL season against the Pittsburgh Steelers."
    },
    {
      "id": "d092337b760edb9e",
      "title": "Colts activate CB Jaylon Jones",
      "link": "https://fox59.com/sports/colts-activate-cb-jaylon-jones/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-01T16:10:39+0000",
      "summary": "INDIANAPOLIS – As expected, the Indianapolis Colts have added Jaylon Jones to the active roster for Sunday’s road game against the Pittsburgh Steelers. The veteran cornerback has been on the injured reserve list since re-injuring a hamstring injury in the season opener against Miami. The Colts opened the 21-day window for Jones’ return Oct. 20. [...]"
    },
    {
      "id": "050579b04bf03dd8",
      "title": "Colts activate CB Jaylon Jones from IR; sign CB Cameron Mitchell to 53-man roster from practice squad; waive LB Chad Muma, S Trey Washington; elevate DE Durell Nchami, WR Laquon Treadwell to active roster from practice squad for Week 9",
      "link": "https://colts.com/news/colts-activate-jaylon-jones-injured-reserve-cameron-mitchell-laquon-treadwell-week-9-steelers-roster-moves",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-01T15:44:21+0000",
      "summary": "The Colts made the roster moves on Saturday."
    },
    {
      "id": "dd5c937df17cb9fc",
      "title": "CB Jaylon Jones getting close to returning for Colts",
      "link": "https://fox59.com/sports/colts/cb-jaylon-jones-getting-close-to-returning-for-colts/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-10-31T20:34:53+0000",
      "summary": "INDIANAPOLIS – Relief might be near for the Indianapolis Colts’ most stressed position. Cornerback Jaylon Jones went through a full week of practice and is questionable for Sunday’s road test with the Pittsburgh Steelers. He remains on the injured reserve list with a hamstring injury, but has practiced the past two weeks. The team opened [...]"
    },
    {
      "id": "638a6201d496e5b7",
      "title": "Will the Ballard Era Colts finally be active at the NFL Trade Deadline?",
      "link": "https://stampedeblue.com/analysis/117119/will-the-ballard-era-colts-finally-be-active-at-the-nfl-trade-deadline",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-10-31T19:04:11+0000",
      "summary": "Indianapolis, IN — Under general manager Chris Ballard, the Indianapolis Colts have historically avoided the mid-season headache that the NFL trade deadline brings. Partly because there are oftentimes more losers than winners across these deadline deals, but mainly because the Colts have, for the most part, not been in a position to add talent. The [&#8230;]"
    },
    {
      "id": "e00f67f68a391236",
      "title": "Colts rule out DE Samson Ebukam, WR Anthony Gould for Week 9 game vs. Pittsburgh Steelers",
      "link": "https://colts.com/news/colts-rule-out-de-samson-ebukam-wr-anthony-gould-for-week-9-game-vs-pittsburgh-steelers",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-31T16:54:44+0000",
      "summary": "Defensive tackle Grover Stewart (toe) was not ruled out despite only participating in practice on Friday."
    },
    {
      "id": "0c9d81ed8468111d",
      "title": "Colts are looking to buck the trend against the Steelers",
      "link": "https://stampedeblue.com/analysis/117110/colts-are-looking-to-buck-the-trend-against-the-steelers",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-10-31T16:52:39+0000",
      "summary": "The red hot Indianapolis Colts are taking their talents on the road as they meet up with the semi-spiraling Pittsburgh Steelers. For eleven years the Colts couldn’t win week one. That streak finally broke and with it, the floodgates seemed to open as Indianapolis is running through opponents like a Manning-style buzzsaw. The attention now [&#8230;]"
    },
    {
      "id": "96fe54f0f85f860b",
      "title": "Colts-Steelers preview: Loud environment, Hall of Fame QB & Mike Tomlin await in Week 9",
      "link": "https://colts.com/news/colts-steelers-preview-loud-environment-hall-of-fame-qb-mike-tomlin-await-in-week-9",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-31T15:31:07+0000",
      "summary": "The Colts will look to stay undefeated against AFC opponents on Sunday against the Pittsburgh Steelers at Acrisure Stadium."
    },
    {
      "id": "a12c088ffdf02bb6",
      "title": "5 Questions with Behind the Steel Curtain: Can the Pittsburgh D slow the Indy O?",
      "link": "https://stampedeblue.com/interviews/117099/5-questions-with-behind-the-steel-curtain-can-the-pittsburgh-d-slow-the-indy-o-mike-tomlin-daniel-jones-aaron-rodgers-tyler-warren-derrick-harmon",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-10-31T14:30:00+0000",
      "summary": "In Week 9 of 2025 our Indianapolis Colts will travel to take on the Pittsburgh Steelers. Knowing the party was hitting the road, I sat down with Ryan Parish of Behind the Steel Curtain, SB Nation’s Steelers blog. You can find him on Twitter @RyanParishmedia. We swapped questions and answers about both the Steelers and [&#8230;]"
    },
    {
      "id": "fd303d7584a2e3e1",
      "title": "Colts’ Players to Watch: Week 9 @Steelers",
      "link": "https://stampedeblue.com/analysis/116962/colts-players-to-watch-week-9-steelers",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-10-31T14:25:02+0000",
      "summary": "Jaylon Jones This will be Jones’ first game back from his IR stint dealing with a hamstring injury. He joins a secondary that is desperate at cornerback, so even average play would be a huge upgrade over what we currently have. There could be some rust, and more than him playing lights out I just [&#8230;]"
    },
    {
      "id": "c9c231a0130c02fe",
      "title": "Week 8 Colts Defensive Rankings and Analysis",
      "link": "https://stampedeblue.com/nfl-analysis-play-breakdowns/117058/week-8-colts-defensive-rankings-and-analysis",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-10-30T21:49:00+0000",
      "summary": "Each week during the season, I will be walking through the data from the previous&#160;Colts&#160;game and analyzing the numbers to form a sort of “what happened” narrative, as well as comparing the Colts against all other teams in the league. For a glossary of the stats listed, reference&#160;Season Stats. Thanks to&#160;Pro Football Reference,&#160;NFL.com, Pro Football [&#8230;]"
    },
    {
      "id": "7faf55d6b29ca9f6",
      "title": "Jonathan Taylor on MVP: You just have to do enough",
      "link": "https://fox59.com/sports/colts/jonathan-taylor-on-mvp-you-just-have-to-do-enough/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-10-30T21:09:20+0000",
      "summary": "INDIANAPOLIS – There wasn’t a second of hesitation from someone who only needs a split-second to do something special. Would it mean something to win MVP? “Of course,’’ Jonathan Taylor said Thursday. There was a brief pause, then laughter because of the brevity – the of course it would – of his response. But the thought [...]"
    },
    {
      "id": "c5ff5b2039af2f14",
      "title": "Colts Reacts Survey Week 9",
      "link": "https://stampedeblue.com/general/116965/colts-reacts-survey-week-9",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-10-30T20:38:09+0000",
      "summary": "Welcome to SB Nation Reacts, a survey of fans across the NFL. Throughout the year we ask questions of the most plugged-in Colts fans and fans across the country. Sign up here to participate in the weekly emailed surveys. Heading into Week 9, we want to know how you’re feeling after watching the team so [&#8230;]"
    },
    {
      "id": "d4c8e8cdba27bbc6",
      "title": "The Colts Show Mailbag: Playoff odds, Week 9 vs. Steelers, trade deadline",
      "link": "https://colts.com/news/the-colts-show-mailbag-playoff-odds-week-9-vs-steelers-trade-deadline",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-30T20:21:01+0000",
      "summary": "The Colts Show Mailbag returns for Week 9 as JJ Stankevitz answers listener, viewer and reader questions on Colts.com."
    },
    {
      "id": "2c849fce7bd82925",
      "title": "Practice Notebook: Jonathan Taylor is one of the best running backs in the NFL, and wants none of the credit for it",
      "link": "https://colts.com/news/practice-notebook-jonathan-taylor-nfl-running-back-colts-offensive-line-wide-receivers-shane-steichen",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-30T19:46:30+0000",
      "summary": "On Thursday, Taylor was named the AFC Offensive Player of the Month for October."
    },
    {
      "id": "2648b317b7a2a586",
      "title": "Colts Blue Zone Podcast 437: Colts Head to Pittsburgh to Take on Rodgers, Steelers",
      "link": "https://fox59.com/sports/colts/colts-blue-zone-podcast-437-colts-head-to-pittsburgh-to-take-on-rodgers-steelers/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-10-30T18:31:20+0000",
      "summary": "The Indianapolis Colts (7-1) head to Pittsburgh to take on Aaron Rodgers and the Steelers (4-3). Dave Griffiths, Mike Chappell and Matt Adams preview the game in the latest edition of the Colts Blue Zone Podcast. Plus: a monthly award for Jonathan Taylor (and some MVP talk), a team honor for long snapper Luke Rhodes, [...]"
    },
    {
      "id": "eef5eba7755ebbdc",
      "title": "Ameer Abdullah is one of the NFL's longest-tenured running backs. How he's made it this far is not by accident.",
      "link": "https://colts.com/news/ameer-abdullah-is-one-of-the-nfl-s-longest-tenured-running-backs-how-he-s-made-it-this-far-is-not-by-accident",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-30T18:30:18+0000",
      "summary": "Ameer Abdullah is in his 11th year in the NFL, and the Colts are thrilled to have him around their facility and on the field in whatever capacity they need him."
    },
    {
      "id": "7fb2d29fbdc62e3e",
      "title": "Jonathan Taylor runs wild to earn AFC Offensive Player of the Month",
      "link": "https://stampedeblue.com/analysis/117077/jonathan-taylor-runs-wild-to-earn-afc-player-of-the-month",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-10-30T18:01:05+0000",
      "summary": "Indianapolis Colts running back Jonathan Taylor was named the AFC Offensive Player of the Month for October. The engine driving the NFL’s top offense capped off an astonishing four-game stretch with another phenomenal performance to reassert his status as one of the premier playmakers in the league. Taylor’s numbers in October were a nightmare against [&#8230;]"
    },
    {
      "id": "5b1b68c5c018d59e",
      "title": "Jonathan Taylor named AFC Offensive Player of the Month for October",
      "link": "https://fox59.com/sports/colts/jonathan-taylor-named-afc-offensive-player-of-the-month-for-october/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-10-30T16:32:25+0000",
      "summary": "INDIANAPOLIS – Jonathan Taylor’s prolific pace hasn’t gone unnoticed. The Indianapolis Colts’ feature back has been named the AFC Offensive Player of the Month. Of course he has. In four October games, Taylor rushed for 436 yards and recorded nine touchdowns on 66 attempts (6.6 per rush) and added 93 yards and one TD on [...]"
    },
    {
      "id": "1f2bbf8bd4a10d31",
      "title": "Colts RB Jonathan Taylor named AFC Offensive Player of the Month for October",
      "link": "https://colts.com/news/colts-rb-jonathan-taylor-afc-offensive-player-of-the-month-october-rushing-yards-touchdowns-nfl",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-30T16:00:17+0000",
      "summary": "In the month of October Taylor had 66 carries for 436 yards (6.6 yards/attempt) and scored 10 total touchdowns (nine rushing, one receiving)."
    },
    {
      "id": "30c940fbee67076f",
      "title": "Morgan Wallen announces \"Still The Problem Tour 2026\"",
      "link": "https://colts.com/news/morgan-wallen-still-the-problem-tour-2026-tickets-presale-lucas-oil-stadium",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-30T14:00:00+0000",
      "summary": "Includes two consecutive nights in Indianapolis at Lucas Oil Stadium May 8 and 9 with support from Brooks & Dunn, Ella Langley, Hudson Westbrook, Flatland Cavalry, Zach John King. Colts season ticket member presale begins Thursday, November 6 at 10am EST. General on-sale starting Friday, November 7 at 10 am EST."
    },
    {
      "id": "27488fe79888ccb1",
      "title": "Colts & Lucas Oil announce lineup for 'Colts FanZone' in Berlin",
      "link": "https://colts.com/news/colts-berlin-fanzone-watch-party-lineup-das-center-blue-mascot-edgerrin-james",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-30T12:00:00+0000",
      "summary": "The Indianapolis Colts today announced the lineup of entertainment and activities for the Colts FanZone at Das Center, the team’s Berlin, Germany headquarters during the week leading into the NFL’s 2025 Berlin Game at Olympic Stadium on Sun., Nov. 9."
    },
    {
      "id": "b271a55164e0c2b2",
      "title": "Colts und Lucas Oil geben line-up für die \"Colts FanZone\" in Berlin bekannt",
      "link": "https://colts.com/news/colts-und-lucas-oil-geben-line-up-fur-die-colts-fanzone-in-berlin-bekannt",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-30T11:59:00+0000",
      "summary": "Die Indianapolis Colts gaben heute das Programm und die Aktivitäten für die “Colts FanZone im Das Center am Potsdamer Platz”, ehemals bekannt als Sony Center ,dem zentralen Treffpunkt des Teams in Berlin, bekannt, die in der Woche vor dem NFL-Spiel 2025 Berlin im Olympiastadion am Sonntag, den 9. November stattfinden werden."
    },
    {
      "id": "315ce4a2d28c6311",
      "title": "Colts’ Braden Smith 'felt very eager to prove something to myself'",
      "link": "https://fox59.com/sports/colts/colts-braden-smith-felt-very-eager-to-prove-something-to-myself/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-10-29T23:01:26+0000",
      "summary": "INDIANAPOLIS — There was a moment Sunday at Lucas Oil Stadium when Braden Smith was reminded of the life-struggle he’s dealing with. In his world, two wolves demanded to be fed. “I choose not to feed my OCD,’’ Smith said. Instead, he immediately relied on the tools gathered during a months-long journey to come to [...]"
    },
    {
      "id": "4e9c17b9da957da6",
      "title": "Jonathan Taylor voted Week 8 FedEx Ground Player of the Week",
      "link": "https://colts.com/news/jonathan-taylor-voted-week-8-fedex-ground-player-of-the-week-edgerrin-james-colts-history-titans",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-29T20:17:26+0000",
      "summary": "Taylor rushed for 153 yards and two touchdowns and recorded 21 receiving yards and one receiving touchdown in the Colts' win over the Titans."
    },
    {
      "id": "622c5a51a52eec14",
      "title": "Colts laden zur Watch-Party in Berlin für das Woche 9 Spiel auf RTL ein",
      "link": "https://colts.com/news/colts-steelers-watch-party-in-berlin-rtl-free-tv-spiel-woche-9-2025",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-29T20:00:00+0000",
      "summary": "Zusätzlich hat RTL, einer der NFL-Übertragungspartner in Deutschland, das Spiel Colts gegen Steelers als Free-TV Spiel der Woche ausgewählt."
    },
    {
      "id": "69e2616727a87faa",
      "title": "Practice Notebook: Jaylon Jones 'progressing really well,' listed as full participant in Colts' Wednesday practice ahead of Week 9 game vs. Steelers",
      "link": "https://colts.com/news/practice-notebook-colts-jaylon-jones-cornerback-hamstring-progressing-well-injured-reserve-week-9-steelers",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-29T19:54:50+0000",
      "summary": "The Colts opened Jones’ 21-day window to be activated from injured reserve last week."
    },
    {
      "id": "a3622290c12c91ca",
      "title": "Colts, IHSAA honor high school 'Officiating Crew of the Month' for October",
      "link": "https://colts.com/news/colts-ihsaa-honor-high-school-officiating-crew-of-the-month-for-october-2025",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-29T17:04:26+0000",
      "summary": "The crew also has been instrumental in the education and recruitment of younger officials"
    },
    {
      "id": "773829ee814fac55",
      "title": "From an undersized, small-town recruit to starting on NFL's top offense, Colts center Tanor Bortolini continues to embrace the grind",
      "link": "https://colts.com/news/from-an-undersized-small-town-recruit-to-starting-on-nfl-s-top-offense-colts-center-tanor-bortolini-continues-to-embrace-the-grind",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-29T15:00:09+0000",
      "summary": "Bortolini, in his first year as a full-time starters, is Pro Football Focus' second highest-graded center entering Week 9."
    },
    {
      "id": "483da9fb9065fed5",
      "title": "Colts nominate long snapper Luke Rhodes for 2025 NFL Salute to Service Award",
      "link": "https://colts.com/news/colts-nominate-long-snapper-luke-rhodes-for-2025-nfl-salute-to-service-award",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-29T14:00:01+0000",
      "summary": "Rhodes was raised in a military household and has consistently honored, empowered and connected with active duty servicemembers, their families and veterans during his 10-year NFL career."
    },
    {
      "id": "791388f9bf7c812f",
      "title": "Colts release unofficial depth chart for Week 9 game vs. Pittsburgh Steelers",
      "link": "https://colts.com/news/colts-release-unofficial-depth-chart-for-week-9-game-vs-pittsburgh-steelers-daniel-jones-jonathan-taylor",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-28T20:46:55+0000",
      "summary": "The Colts released their Week 9 unofficial depth chart ahead of their game against the Pittsburgh Steelers Sunday at Acrisure Stadium. Check it out below:"
    },
    {
      "id": "9c7f24af1bd0fe93",
      "title": "Allison Balay of Indianapolis Named 2025 Colts 'Fan of the Year'",
      "link": "https://colts.com/news/allison-balay-of-indianapolis-named-2025-colts-fan-of-the-year",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-28T19:17:00+0000",
      "summary": "Revealing Allison Balay as the 2025 Colts Fan of the Year"
    },
    {
      "id": "d986ea601d2e5b83",
      "title": "Colts partner with Central Indiana Toyota Dealers to surprise Air Force veteran with vehicle donation",
      "link": "https://colts.com/news/colts-partner-with-central-indiana-toyota-dealers-to-surprise-air-force-veteran-with-vehicle-donation",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-28T17:55:35+0000",
      "summary": "Scott Eidson and his family, who recently lost their home to a fire, were recognized at halftime of the Colts' Salute to Service game for their service and sacrifice – and surprised with a brand new car."
    },
    {
      "id": "6598136cdf43c764",
      "title": "5 Colts Things: The key to Jonathan Taylor's season & managing RB's workload, Daniel Jones gets job done, defense continues to generate explosive plays in Week 8 win over Titans",
      "link": "https://colts.com/news/5-colts-things-the-key-to-jonathan-taylor-s-season-managing-rb-s-workload-daniel-jones-gets-job-done-defense-continues-to-generate-explosive-plays-in-week-8-win-over-titans",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-27T22:27:32+0000",
      "summary": "The Colts' 38-14 win over the Tennessee Titans in Week 8 improved their record to an NFL-best 7-1 as the 2025 season nears its halfway point."
    },
    {
      "id": "37e0a4fecdace804",
      "title": "As NFL trade deadline nears, Colts need to be in the mood",
      "link": "https://fox59.com/sports/colts/as-nfl-trade-deadline-nears-colts-need-to-be-in-the-mood/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-10-27T21:35:10+0000",
      "summary": "INDIANAPOLIS – Things have gotten very interesting on West 56th Street. A team that flew completely under the radar during the offseason, preseason and for the first few weeks of the regular season has emerged as something that can’t be ignored. The Indianapolis Colts are an NFL-best 7-1. They hold a 2½-game lead over Jacksonville in [...]"
    },
    {
      "id": "19dfde9261f91e47",
      "title": "Bill Brooks' Breakdown: How Daniel Jones set the standard for a selfless Colts offense in Week 8 win over Titans",
      "link": "https://colts.com/news/bill-brooks-breakdown-colts-week-8-daniel-jones-preparation-standard-offense-jonathan-taylor-offensive-line",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-27T20:00:29+0000",
      "summary": "Colts Ring of Honor wide receiver Bill Brooks gives his insight on just how important a quarterback like Daniel Jones is for an NFL offense and breaks down Jonathan Taylor's impressive performance from the Colts' 38-14 win."
    },
    {
      "id": "30cd61467cd074a4",
      "title": "Colts sign DE Tanoh Kpassagnon, release DE Seth Coleman from practice squad",
      "link": "https://colts.com/news/colts-sign-de-tanoh-kpassagnon-release-de-seth-coleman-from-practice-squad",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-27T19:08:17+0000",
      "summary": "The Colts made the roster moves on Monday."
    },
    {
      "id": "3e5ddf582a7fd1c1",
      "title": "Around the AFC South: 'Locked in' Texans take down injury-riddled 49ers, Colts maintain best record in NFL",
      "link": "https://colts.com/news/around-the-afc-south-locked-in-texans-take-down-injury-riddled-49ers-colts-maintain-best-record-in-nfl",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-27T15:26:22+0000",
      "summary": "The Texans improved to 3-4 with the Week 8 win; the Colts moved to 7-1 after their win over the Titans."
    },
    {
      "id": "5a2a1dac12e536f0",
      "title": "Jonathan Taylor nominated for Week 8 FedEx Ground Player of the Week",
      "link": "https://colts.com/news/jonathan-taylor-nominated-week-8-fedex-ground-player-of-the-week",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-27T14:20:49+0000",
      "summary": "Taylor recorded 174 scrimmage yards (153 rushing, 21 receiving) and three touchdowns (two rushing, one receiving) in the Colts' win over the Titans."
    },
    {
      "id": "26aa2579a57ff3a7",
      "title": "Colts Blue Zone Podcast 436: Colts Demolish Titans as JT, Pitt shine",
      "link": "https://fox59.com/sports/colts/colts-blue-zone-podcast-436-colts-demolish-titans-as-jt-pitt-shine/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-10-27T12:56:52+0000",
      "summary": "The Indianapolis Colts moved to 7-1 with a dominating win over the Tennessee Titans at Lucas Oil Stadium. Jonathan Taylor led the way with three touchdowns and Michael Pittman Jr. made a pair of highlight-worthy catches. Matt Adams recaps the 38-14 win in the latest episode of the Colts Blue Zone Podcast. Find the Colts [...]"
    },
    {
      "id": "81144cd6db20f95b",
      "title": "Colts’ Jonathan Taylor: MVP? He’s running in that direction",
      "link": "https://fox59.com/sports/colts/colts-jonathan-taylor-mvp-hes-running-in-that-direction/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-10-27T02:59:36+0000",
      "summary": "INDIANAPOLIS — The chants began early, gradually intensified and crescendoed with a balance-defying 80-yard tiptoe down the left sideline. MVP, MVP, MVP. Shane Steichen heard it. “I did,’’ he said. MVP, MVP, MVP. And? “Validated,’’ he said. Steichen’s smile reflected his appreciation — and awe — with the latest MVP-type game in what’s building toward [...]"
    },
    {
      "id": "6bf6912e1480e6c0",
      "title": "As halfway point of 2025 nears, Colts' focus is on playing even better football: 'The season starts in November, December'",
      "link": "https://colts.com/news/as-halfway-point-of-2025-nears-colts-focus-is-on-playing-even-better-football-the-season-starts-in-november-december",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-27T02:44:27+0000",
      "summary": "The Colts' 38-14 win over the Tennessee Titans on Sunday boosted their record to 7-1, but their high-flying start has not changed the focus of this team."
    },
    {
      "id": "44c8e98ebaa9e975",
      "title": "Just how good is Colts RB Jonathan Taylor? It's hard to put into words. We'll try anyway.",
      "link": "https://colts.com/news/just-how-good-is-colts-rb-jonathan-taylor-it-s-hard-to-put-into-words-we-ll-try-anyway",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-27T02:09:59+0000",
      "summary": "Jonathan Taylor turned in another outlandish game on Sunday, with three more touchdowns and 174 total yards in the Colts' 38-14 thumping of the Tennessee Titans at Lucas Oil Stadium."
    },
    {
      "id": "1b6acd183941009c",
      "title": "The Colts have the best offense in football, but not having a 100-yard receiver yet is a feature, not a bug",
      "link": "https://colts.com/news/colts-best-offense-nfl-100-yard-josh-downs-receiver-michael-pittman-alec-pierce-daniel-jones-titans-week-8",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-27T01:40:01+0000",
      "summary": "Michael Pittman Jr. had eight receptions for 95 yards in the Colts' 38-14 win over the Titans on Sunday."
    },
    {
      "id": "90db3a9ab61d8a27",
      "title": "Colts dominate Titans again, improve to 7-1 on the season",
      "link": "https://fox59.com/sports/colts/colts-dominate-titans-again-38-14-to-improve-to-7-1/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-10-26T23:23:29+0000",
      "summary": "INDIANAPOLIS — The Indianapolis Colts took the lead on the first possession of the game and never looked back as they beat the Tennessee Titans, 38-14, at Lucas Oil Stadium on Sunday. The Colts have won six straight over the Titans. Indianapolis beat Tennessee, 41-20, in Nashville on Sept. 21. The Colts are now 7-1 [...]"
    },
    {
      "id": "aa98e35fc4fcc6d1",
      "title": "Jonathan Taylor, Colts offense steamroll Titans in Week 8 win",
      "link": "https://colts.com/news/jonathan-taylor-daniel-jones-alec-pierce-colts-offense-titans-week-8-riley-leonard",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-26T23:22:47+0000",
      "summary": "Taylor scored three touchdowns as Colts took down the Titans 38-14 on Sunday, scoring at least 30 points for the sixth time this season."
    },
    {
      "id": "2a219395804692d8",
      "title": "Colts hope Anthony Richardson Sr. returns this season after surgery to repair fractured orbital",
      "link": "https://fox59.com/sports/colts/colts-hope-anthony-richardson-sr-returns-this-season-after-surgery-to-repair-fractured-orbital/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-10-26T19:20:28+0000",
      "summary": "INDIANAPOLIS – The Indianapolis Colts anticipate Anthony Richardson Sr. being available at some point this season after he underwent surgery on Monday to repair a fractured orbital bone. The surgery was reported by NFL Network. Coach Shane Steichen was asked about Richardson’s status on Friday – he was placed on the injured reserve list Oct. [...]"
    },
    {
      "id": "60276505f70cceaa",
      "title": "Colts announce 7 inactive players for Week 8 game vs. Tennessee Titans",
      "link": "https://colts.com/news/colts-announce-7-inactive-players-for-week-8-game-vs-tennessee-titans",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-26T18:55:16+0000",
      "summary": "The Colts previously ruled out Samson Ebukam (knee) Tyquan Lewis (groin)."
    },
    {
      "id": "3c7476a98a07209b",
      "title": "Keys to the Game: Colts vs. Titans",
      "link": "https://fox59.com/sports/colts/keys-to-the-game-colts-vs-titans-2/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-10-26T16:21:21+0000",
      "summary": "INDIANAPOLIS - The Colts are two touchdown favorites against the Titans as the AFC South leaders try to improve to 7-1 this season. IndyStar insider Joel A. Erickson gives his keys to the game if the Colts are going to avoid a major letdown at Lucas Oil Stadium on Sunday afternoon."
    },
    {
      "id": "203fe2477d9b16e1",
      "title": "Sideline to Sideline: HS Football Memory",
      "link": "https://fox59.com/sports/colts/sideline-to-sideline-hs-football-memory/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-10-26T16:20:34+0000",
      "summary": "INDIANAPOLIS - Every week Blue Zone's Chris Widlic asks the Colts one question in \"Sideline to Sideline\". With the IHSAA state football tournament kicking off on Friday night, Chris asks the players this week what their favorite memory is playing high school football."
    },
    {
      "id": "87798559ccd06394",
      "title": "Lucas Oil's roof is closed for Colts vs. Titans",
      "link": "https://fox59.com/sports/colts/lucas-oils-roof-is-closed-for-colts-vs-titans/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-10-26T16:09:57+0000",
      "summary": "INDIANAPOLIS — The roof is closed this week as the Colts prepare to defend home turf against the Tennessee Titans.  The Indianapolis Colts enter the matchup with a league-best 6-1 record and are determined to keep the hot start going with another win in the win column in front of their hometown fans.  Last week, [...]"
    },
    {
      "id": "12b4db94685541ce",
      "title": "How to watch the Tennessee Titans at Indianapolis Colts on October 26, 2025",
      "link": "https://colts.com/news/how-to-watch-titans-at-colts-week-8-2025",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-10-26T12:00:00+0000",
      "summary": "TV broadcast, radio and streaming information for Tennessee Titans at Indianapolis Colts on Sunday, October 26 at 4:25 p.m. ET (Week 8)."
    },
    {
      "id": "09fa0c339aad9b17",
      "title": "Titans at Colts: What to watch for",
      "link": "https://fox59.com/sports/colts/titans-at-colts-what-to-watch-for-3/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-10-25T20:31:46+0000",
      "summary": "INDIANAPOLIS – Areas of interest in the Indianapolis Colts’ rematch with the Tennessee Titans Sunday at Lucas Oil Stadium: History lesson, Part I The Colts have reapplied a stranglehold on a series they lead 40-23. They’ve won five straight and are going for their third straight seasonal sweep after dominating the Titans 41-20 in week [...]"
    }
  ],
  "links": [
    {
      "label": "Schedule",
      "url": "https://www.colts.com/schedule/"
    },
    {
      "label": "Roster",
      "url": "https://www.colts.com/team/players-roster/"
    },
    {
      "label": "Depth Chart",
      "url": "https://www.espn.com/nfl/team/depth/_/name/ind/indianapolis-colts"
    },
    {
      "label": "Injury Report",
      "url": "https://www.colts.com/team/injury-report/"
    },
    {
      "label": "Fan Zone",
      "url": "https://www.colts.com/fans/"
    },
    {
      "label": "Team Shop",
      "url": "https://shop.colts.com/"
    },
    {
      "label": "Tickets",
      "url": "https://www.colts.com/tickets/"
    },
    {
      "label": "Reddit",
      "url": "https://www.reddit.com/r/Colts/"
    },
    {
      "label": "Bleacher Report",
      "url": "https://bleacherreport.com/indianapolis-colts"
    },
    {
      "label": "ESPN Team",
      "url": "https://www.espn.com/nfl/team/_/name/ind/indianapolis-colts"
    },
    {
      "label": "Yahoo Team",
      "url": "https://sports.yahoo.com/nfl/teams/ind/"
    },
    {
      "label": "PFF Team Page",
      "url": "https://www.pff.com/nfl/teams/indianapolis-colts"
    },
    {
      "label": "Pro-Football-Reference",
      "url": "https://www.pro-football-reference.com/teams/clt/"
    },
    {
      "label": "NFL Power Rankings",
      "url": "https://www.nfl.com/news/nfl-power-rankings"
    },
    {
      "label": "Stats",
      "url": "https://www.teamrankings.com/nfl/team/indianapolis-colts"
    },
    {
      "label": "Standings",
      "url": "https://www.nfl.com/standings/league/2025/REG"
    }
  ],
  "sources": [
    "Colts.com",
    "IndyStar",
    "Colts Wire",
    "Stampede Blue",
    "The Athletic",
    "ESPN",
    "Yahoo Sports",
    "Sports Illustrated",
    "CBS Sports",
    "FOX59 / CBS4"
  ]
}