{
  "updated": "2025-11-19T08:49:40+00:00",
  "items": [
    {
      "id": "9c19e51a7bde48eb",
      "title": "Ja'Marr Chase's one-game suspension upheld, will miss Patriots game",
      "link": "https://sports.yahoo.com/article/jamarr-chases-one-game-suspension-080213761.html",
      "source": "Yahoo Sports",
      "feed": "Yahoo Sports",
      "published": "2025-11-19T08:02:13+0000",
      "summary": "Ja’Marr Chase’s one-game suspension for spitting on Pittsburgh Steelers defensive back Jalen Ramsey has been upheld by a hearing officer, which rules him out of Sunday's game against the New England Patriots.  The suspension, without pay, was upheld Tuesday by hearing officer Jordy Nelson, jointly appointed by the NFL and the NFLPA."
    },
    {
      "id": "38997379eaf240a1",
      "title": "Week 12 NFL Power Rankings: Bengals and Vikings drop, plus who is under the most pressure on each team",
      "link": "https://espn.com/nfl/story/_/id/46999579/nfl-week-12-power-rankings-poll-32-teams-2025-pressure-players-coaches-executives",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-11-19T03:24:48+0000",
      "summary": "Let's update our rankings ahead of Week 12. Plus, who is under the most pressure for each team over the rest of the 2025 season?"
    },
    {
      "id": "07d0cf471550aeca",
      "title": "What has gone right, wrong for every NFL OC, playcaller this season",
      "link": "https://espn.com/nfl/story/_/id/46970963/nfl-offensive-coordinators-playcallers-josh-mcdaniels-dan-campbell",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-11-19T03:24:48+0000",
      "summary": "NFL Nation reporters break down the good and bad for each OC/playcaller and peg the key to success."
    },
    {
      "id": "9789af9a4b911bd2",
      "title": "Colts announce slew of roster moves, including reunion with veteran safety",
      "link": "https://stampedeblue.com/indianapolis-colts-news/118002/colts-announce-slew-of-roster-moves-including-reunion-with-veteran-safety",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-11-19T01:11:38+0000",
      "summary": "The Indianapolis Colts announced the signing of defensive end Viliami Fehoko Jr., safety George Odum, wide receiver Eli Pancol, and defensive tackle Chris Wormley to the practice squad, while also releasing defensive end Tanoh Kpassagnon, tight end Maximilian Mang, and cornerback Troy Pride Jr. in corresponding roster moves. It was reported yesterday by CBS Sports’ [&#8230;]"
    },
    {
      "id": "0b78b9997b09220b",
      "title": "Colts Reacts Survey Week 12",
      "link": "https://stampedeblue.com/indianapolis-colts-news/117988/colts-reacts-survey-week-12",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-11-19T00:47:47+0000",
      "summary": "Welcome to SB Nation Reacts, a survey of fans across the NFL. Throughout the year we ask questions of the most plugged-in Colts fans and fans across the country. Sign up here to participate in the weekly emailed surveys. Please take our survey"
    },
    {
      "id": "1db9adff6af19d30",
      "title": "Michael Pittman Jr. on Alec Pierce: “The price keeps going up.”",
      "link": "https://stampedeblue.com/analysis/117983/michael-pittman-jr-on-alec-pierce-the-price-keeps-going-up",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-11-18T23:00:00+0000",
      "summary": "Unsung hero, underappreciated, unexpectedly fast — these are just a few words that aptly describe Indianapolis Colts’ wide receiver Alec Pierce. Being known for his blazing speed is one thing, and being regarded as a ‘deep threat’ in the NFL is equal parts complimentary as it is derogatory, except somehow, they go hand in hand; [&#8230;]"
    },
    {
      "id": "410c4c00c87a7c61",
      "title": "Sauce Gardner returns to Colts from bye week refreshed, and with the right message from Lou Anarumo",
      "link": "https://colts.com/news/sauce-gardner-returns-to-colts-from-bye-week-refreshed-and-with-the-right-message-from-lou-anarumo",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-18T21:21:37+0000",
      "summary": "When Sauce Gardner takes the field for his second game in a Colts uniform on Sunday against the Kansas City Chiefs, he'll do so with a clear focus."
    },
    {
      "id": "43ec3305e78e0348",
      "title": "What do Week 11 games mean for the rest of the season? We hit big questions, key stats and QB breakouts",
      "link": "https://espn.com/nfl/story/_/id/46928269/nfl-week-11-2025-season-questions-takeaways-lessons-stats-recap-every-game",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-11-18T21:05:30+0000",
      "summary": "Our NFL Nation reporters answer the biggest questions from each game. Here's what we learned from Week 11."
    },
    {
      "id": "735e44c78c435c6e",
      "title": "Colts release unofficial depth chart for Week 12 game vs. Kansas City Chiefs",
      "link": "https://colts.com/news/colts-release-unofficial-depth-chart-for-week-12-game-vs-kansas-city-chiefs",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-18T20:27:38+0000",
      "summary": "The Colts released their Week 12 unofficial depth chart ahead of their game against the Kansas City Chiefs Sunday at Arrowhead Stadium. Check it out below:"
    },
    {
      "id": "0e3b26b5b98a4fdf",
      "title": "Colts sign DE Viliami Fehoko Jr., S George Odum, WR Eli Pancol, DT Chris Wormley to practice squad; release DE Tanoh Kpassagnon, TE Max Mang, CB Troy Pride Jr. from practice squad",
      "link": "https://colts.com/news/colts-sign-de-viliami-fehoko-jr-s-george-odum-wr-eli-pancol-dt-chris-wormley-to-practice-squad-release-de-tanoh-kpassagnon-te-max-mang-cb-troy-pride-jr-from-practice-squad",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-18T18:55:44+0000",
      "summary": "The Colts made the roster moves on Tuesday."
    },
    {
      "id": "3559d8ecdc23700c",
      "title": "NFL playoff picture projections: Updated chances to make the postseason, win divisions",
      "link": "https://espn.com/nfl/story/_/id/46139564/2025-nfl-playoff-picture-afc-nfc-seed-predictions-odds-super-bowl",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-11-18T18:37:37+0000",
      "summary": "We're looking ahead to how the 14-team playoff picture could line up en route to Super Bowl LX."
    },
    {
      "id": "4d9053561480ae99",
      "title": "NFL draft risers, questions and notes: How does this WR class stack up?",
      "link": "https://espn.com/nfl/draft2026/story/_/id/45531306/2026-nfl-draft-notebook-questions-latest-updates-risers-cfb-prospects",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-11-18T18:10:12+0000",
      "summary": "We have NFL draft notes through CFB Week 12, including why Zachariah Branch and Makai Lemon are intriguing prospects."
    },
    {
      "id": "5b2e6c043ef838b1",
      "title": "Sauce Gardner is looking forward to ‘putting on a clinic’ alongside Charvarius Ward",
      "link": "https://stampedeblue.com/analysis/117941/sauce-gardner-is-looking-forward-to-putting-on-a-clinic-alongside-charvarius-ward",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-11-18T17:26:36+0000",
      "summary": "Indianapolis, IN — The Indianapolis Colts, specifically their defense, underwent an overnight transformation with one phone call. After months of inconsistent play in the passing game on defense, Colts general manager Chris Ballard secured the biggest move of his tenure by trading two first-round picks and second-year WR AD Mitchell to the New York Jets [&#8230;]"
    },
    {
      "id": "0f19555167e35a41",
      "title": "Colts injury update: Status quo still remains same for key players—for now",
      "link": "https://stampedeblue.com/indianapolis-colts-news/117952/colts-injury-update-status-quo-still-remains-same-for-key-players-for-now",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-11-18T01:30:39+0000",
      "summary": "According to Indianapolis Colts head coach Shane Steichen, he didn’t have a specific injury update for a pair of veterans, defensive tackle DeForest Buckner (neck) and cornerback Charvarius Ward (concussion), as well as for quarterback Anthony Richardson (orbital fracture) on Monday (via The Athletic’s James Boyd): All three players are currently on injured reserve, but [&#8230;]"
    },
    {
      "id": "4ee11a51c921ee2c",
      "title": "The Broncos beating the Chiefs might turn out to be good news for the Colts",
      "link": "https://stampedeblue.com/analysis/117943/the-broncos-beating-the-chiefs-might-turn-out-to-be-good-news-for-the-colts",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-11-17T23:47:37+0000",
      "summary": "If an Indianapolis Colts’ fan watched the Denver Broncos host the Kansas City Chiefs, they may have found themselves rooting for the Chiefs. That makes total sense. A loss by the Broncos would have helped the Colts maintain pace in the AFC and stay in second behind the Patriots. Although the Colts didn’t get a [&#8230;]"
    },
    {
      "id": "a97a4280caf87f77",
      "title": "Report: D-line depleted Colts expected to sign ex-Ravens veteran DT to practice squad",
      "link": "https://stampedeblue.com/indianapolis-colts-news/117947/report-d-line-depleted-colts-signing-ex-ravens-veteran-dt-to-practice-squad",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-11-17T23:05:33+0000",
      "summary": "According to CBS Sports’ Matt Zenitz, the Indianapolis Colts are signing former Baltimore Ravens veteran defensive tackle Chris Wormley to their practice squad: With All-Pro stalwart DeForest Buckner out at least until Week 15 on the road against the Seattle Seahawks on injured reserve, the Colts could eventually be activating some veteran interior defensive line [&#8230;]"
    },
    {
      "id": "b7b283f71f6776f7",
      "title": "Colts are in good position at 8-2 after bye, but must 'go out and finish our business'",
      "link": "https://fox59.com/sports/colts/colts-are-in-good-position-at-8-2-after-bye-but-must-go-out-and-finish-our-business/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-17T22:46:32+0000",
      "summary": "INDIANAPOLIS – They’ve been in this situation before. As the Indianapolis Colts come out of their bye and prepare for the final seven games of the season, they’re in position to do something noteworthy. At 8-2, they’re the No. 3 seed in the AFC – New England and Denver are 9-2 – and are atop [...]"
    },
    {
      "id": "a04a998f4d2bb22d",
      "title": "Players react to NFL's efforts to halt team report cards: 'The fact that there's pushback shows it's working'",
      "link": "https://espn.com/nfl/story/_/id/46995326/nfl-players-nflpa-reaction-2025-league-grievance-team-report-cards-survey",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-11-17T21:34:58+0000",
      "summary": "NFL players who spoke to ESPN say the report cards are making a tangible impact on workplace conditions."
    },
    {
      "id": "74da56519593b699",
      "title": "Colts return from bye week focused on Kansas City Chiefs, not previous accomplishments",
      "link": "https://colts.com/news/colts-return-from-bye-week-focused-on-kansas-city-chiefs-not-previous-accomplishments",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-17T21:22:39+0000",
      "summary": "The Colts re-convened at the Indiana Farm Bureau Football Center on Monday not satisfied with being 8-2, and with their focus firmly shifting to Sunday's matchup with the Chiefs in Kansas City."
    },
    {
      "id": "b6c795789d09a2d9",
      "title": "Bill Brooks' Breakdown: Jonathan Taylor's historic season, Sauce Gardner's arrival and the importance of the bye week",
      "link": "https://colts.com/news/bill-brooks-breakdown-jonathan-taylor-historic-season-sauce-gardner-colts-defense-bye-week-schedule-afc-south",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-17T20:39:39+0000",
      "summary": "Colts Ring of Honor wide receiver Bill Brooks gives his perspective on Jonathan Taylor’s historic performance so far this season, what Sauce Gardner’s arrival means and how crucial the Colts’ bye week was before the last seven games of the regular season."
    },
    {
      "id": "8b23e542fb6086fa",
      "title": "NFL futures: Defending champ Eagles now Super Bowl favorite, followed by Rams",
      "link": "https://espn.com/espn/betting/story/_/id/43748901/super-bowl-2026-odds-win-nfl-betting",
      "source": "ESPN",
      "feed": "ESPN",
      "published": "2025-11-17T19:38:07+0000",
      "summary": "Updated 2025 NFL win totals and odds for every team to make the playoffs, win their division, conference and Super Bowl LX."
    },
    {
      "id": "6d4bc21671183c30",
      "title": "Did the Colts lose the bye week?",
      "link": "https://stampedeblue.com/analysis/117931/did-the-colts-lose-the-bye-week",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-11-17T18:46:47+0000",
      "summary": "The Indianapolis Colts did not play in the NFL’s Week 11 slate, but they still took a loss of sorts. Although Indy’s commercial break from regularly scheduled programming allowed them to reset both mentally and phyiscally, they had to sit back and watch the rest of the league fight for playoff seeding. As a result, [&#8230;]"
    },
    {
      "id": "6e2d25450687ab11",
      "title": "Around the AFC South: Jaguars dominate Chargers, Texans squeeze out win over Titans",
      "link": "https://colts.com/news/week-11-afc-south-jaguars-trevor-lawrence-chargers-texans-titans-davis-mills-cj-stroud-colts",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-17T17:03:08+0000",
      "summary": "The Jaguars are now 6-4 and the Texans are 5-5; the Colts remain atop the division with an 8-2 record after the bye week."
    },
    {
      "id": "0a44916c8d676562",
      "title": "Colts-Chiefs opening odds: Colts have another shot at statement win",
      "link": "https://stampedeblue.com/indianapolis-colts-odds/117925/colts-chiefs-opening-odds-colts-have-another-shot-a-statement-win",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-11-17T14:00:00+0000",
      "summary": "The Indianapolis Colts and Kansas City Chiefs have been running in different NFL social circles over the last seven or so years. The Chiefs have made many deep playoff runs and hoisted three Lombardi trophies over that time. Meanwhile, the Colts have been treading water and searching for an identity. Just like all pendulums, this [&#8230;]"
    },
    {
      "id": "c48bda548e133b4d",
      "title": "AFC Playoff Picture: Colts fall from first to third on Week 11 bye",
      "link": "https://stampedeblue.com/indianapolis-colts-news/117921/afc-playoff-picture-colts-fall-from-first-to-third-on-week-11-bye",
      "source": "Stampede Blue",
      "feed": "Stampede Blue",
      "published": "2025-11-17T01:02:59+0000",
      "summary": "The Indianapolis Colts are on the bye in Week 11, and while they entered it in first place in the AFC, they have dropped not one but two slots in the playoff picture. The New England Patriots became the first nine-win team in the NFL on Thursday night, defeating the New York Jets, and taking [&#8230;]"
    },
    {
      "id": "2557c53a085e9595",
      "title": "Colts’ DeForest Buckner turned to stem cell treatment to address neck injury",
      "link": "https://fox59.com/sports/colts/colts-deforest-buckner-turned-to-stem-cell-treatment-to-address-neck-injury/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-15T03:53:21+0000",
      "summary": "INDIANAPOLIS – DeForest Buckner has taken a familiar approach in his attempt to return from a neck injury. The Indianapolis Colts’ veteran defensive tackle posted on social media Friday that he traveled to Panama this week to receive stem cell injections as part of his treatment for a neck injury that resulted in him being [...]"
    },
    {
      "id": "57fc3bf31db9d703",
      "title": "Colts Blue Zone Podcast 441: Bye Week Blitz",
      "link": "https://fox59.com/sports/colts/colts-blue-zone-podcast-441-bye-week-blitz/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-13T19:41:52+0000",
      "summary": "With the Indianapolis Colts on the bye week, the Colts Blue Zone crew takes a look at what's worked so far this season and explores some areas where the team can improve as Indy hits the home stretch. At 8-2, the Colts sit atop the AFC South and boast one of the league's top offenses. [...]"
    },
    {
      "id": "932aa20a9e14fbb5",
      "title": "Colts’ Jonathan Taylor AFC Offensive Player of the Week",
      "link": "https://fox59.com/sports/colts/colts-jonathan-taylor-afc-offensive-player-of-the-week-3/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-12T19:38:25+0000",
      "summary": "INDIANAPOLIS – The honors keep flowing in for Jonathan Taylor. The Indianapolis Colts’ veteran running back has been named AFC Offensive Player of the Week after being the catalyst for Sunday’s 31-25 overtime win over the Atlanta Falcons in Berlin. Taylor rushed 32 times for 244 yards and three touchdowns and added three receptions for [...]"
    },
    {
      "id": "fc6a05142a575e07",
      "title": "Matt Taylor discusses calling Colts game in Berlin",
      "link": "https://fox59.com/sports/colts/matt-taylor-discusses-calling-colts-game-in-berlin/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-12T15:29:43+0000",
      "summary": "The Indianapolis Colts came away with a thrilling 31-25 overtime win against the Atlanta Falcons. This was anything but a typical NFL matchup, as the team traveled to Germany for a \"home game.\" Matt Taylor, radio voice of the Colts, appeared on FOX59 Morning News to discuss the unique experience of calling the Nov. 9 [...]"
    },
    {
      "id": "8c7c1604e81b09f1",
      "title": "Colts, Kicking The Stigma encourage fans to focus on mental health during bye week",
      "link": "https://colts.com/news/colts-kicking-the-stigma-encourage-fans-to-focus-on-mental-health-during-2025-bye-week",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-12T14:00:00+0000",
      "summary": "The Colts' digital and social media channels will not publish content between Wednesday morning and Monday morning, and we encourage fans to take disconnect from devices during the bye week as well."
    },
    {
      "id": "3609fafab0187bfe",
      "title": "Colts hit bye at 8-2, but Daniel Jones’ protection must  be addressed; had lost 10 straight giving up 7 sacks",
      "link": "https://fox59.com/sports/colts/colts-hit-bye-at-8-2-but-daniel-jones-protection-must-be-addressed-had-lost-10-straight-giving-up-7-sacks/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-11T00:52:42+0000",
      "summary": "INDIANAPOLIS – Three bits of reality followed the Indianapolis Colts back home from Berlin and into their bye week. Item 1: At 8-2, they’re the No. 1 seed in the AFC and have created separation in the AFC South with 5-4 Jacksonville and 4-5 Houston. Item 2: Jonathan Taylor has positioned himself to be the first running [...]"
    },
    {
      "id": "4b9674b401f70a1b",
      "title": "5 Colts Things: More context for Jonathan Taylor's 17 touchdowns, plus Tyler Warren, Daniel Jones, Zaire Franklin and special teams make key plays to push Colts to 8-2 at bye week",
      "link": "https://colts.com/news/5-colts-things-more-context-for-jonathan-taylor-s-17-touchdowns-plus-tyler-warren-daniel-jones-zaire-franklin-and-special-teams-make-key-plays-to-push-colts-to-8-2-at-bye-week",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-10T18:58:49+0000",
      "summary": "The Colts' 31-25 overtime win over the Atlanta Falcons on Sunday sent them into their bye week with an 8-2 record and a 2.5-game lead in the AFC South."
    },
    {
      "id": "c14520ce80bf6837",
      "title": "Around the AFC South: Texans score 26 points in fourth quarter to take down Jaguars",
      "link": "https://colts.com/news/around-the-afc-south-texans-fourth-quarter-comeback-jaguars-trevor-lawrence-colts-first-place",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-10T16:19:59+0000",
      "summary": "With their overtime win over the Falcons on Sunday, the 8-2 Colts remain firmly in first place in the AFC South."
    },
    {
      "id": "f5fadc3e0a13d82d",
      "title": "Colts Blue Zone Podcast 440: Overtime Insanity as Colts Top Falcons",
      "link": "https://fox59.com/sports/colts/colts-blue-zone-podcast-440-overtime-insanity-as-colts-top-falcons/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-10T15:59:53+0000",
      "summary": "The Indianapolis Colts won a thriller in Berlin. Matt Adams recaps the game in the latest Blue Zone Podcast. Find the Colts Blue Zone Podcast on YouTube, Apple Podcasts or Spotify."
    },
    {
      "id": "31ed1cd8d23f78cb",
      "title": "Colts fans from all over the world deliver remarkable atmosphere in Berlin before, during and after incredible overtime win over Falcons",
      "link": "https://colts.com/news/colts-fans-from-all-over-the-world-deliver-remarkable-atmosphere-in-berlin-before-during-and-after-incredible-overtime-win-over-falcons",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-10T15:19:28+0000",
      "summary": "Colts fans from several continents descended upon Berlin this week to create a special environment of different cultures coming together because of one central thing: A love and passion for the Indianapolis Colts."
    },
    {
      "id": "4381759e5e62004d",
      "title": "Jonathan Taylor nominated for Week 10 FedEx Ground Player of the Week",
      "link": "https://colts.com/news/jonathan-taylor-nominated-week-10-fedex-ground-player-of-the-week-colts-falcons-overtime-touchdowns",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-10T14:44:52+0000",
      "summary": "Taylor recorded 286 scrimmage yards (244 rushing, 44 receiving) and three rushing touchdowns in the Colts' OT win over the Falcons."
    },
    {
      "id": "081d91533869557e",
      "title": "Statement from the Indianapolis Colts",
      "link": "https://colts.com/news/statement-from-the-indianapolis-colts-nfl-commissioner-paul-tagliabue",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-10T14:17:05+0000",
      "summary": ""
    },
    {
      "id": "036049389218b1ff",
      "title": "Colts’ follow record-setting Jonathan Taylor to OT win over Falcons in Berlin’s historic Olympic Stadium",
      "link": "https://fox59.com/sports/colts/colts-follow-record-setting-jonathan-taylor-to-ot-win-over-falcons-in-berlins-historic-olympic-stadium/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-09T23:29:07+0000",
      "summary": "INDIANAPOLIS – The Indianapolis Colts went international. Jonathan Taylor went off. “Look,’’ said Zaire Franklin. “I’ll scream it from the mountaintops. “He’s the MVP in my book.’’ “It’s phenomenal the way he’s been running,’’ added Shane Steichen. In the NFL’s first game at Berlin’s historic Olympic Stadium on Sunday, Taylor’s brilliance carried the Colts when [...]"
    },
    {
      "id": "bc67c952e82f3ff7",
      "title": "Sauce Gardner makes immediate impact in Colts debut",
      "link": "https://colts.com/news/sauce-gardner-colts-debut-pass-rush-coverage-falcons-drake-london-overtime-win",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-09T20:42:19+0000",
      "summary": "Gardner just met his new teammates and coaches on Wednesday, but already fit in seamlessly as he helped the Colts secure an overtime win over the Atlanta Falcons on Sunday."
    },
    {
      "id": "2fb4a35ac6e5819b",
      "title": "Jonathan Taylor takes historic season to international stage with 3-touchdown, record-breaking, walk-off performance vs. Falcons",
      "link": "https://colts.com/news/jonathan-taylor-takes-historic-season-to-international-stage-with-3-touchdown-record-breaking-walk-off-performance-vs-falcons",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-09T20:30:31+0000",
      "summary": "Taylor rushed for 244 yards and three touchdowns in the Colts' 31-25 win over the Atlanta Falcons on Sunday at Olympic Stadium in Berlin."
    },
    {
      "id": "d2e738e8ac5158c5",
      "title": "Taylor's touchdown in overtime propels Colts over Falcons in Berlin",
      "link": "https://fox59.com/sports/colts/taylors-touchdown-in-overtime-propels-colts-over-falcons-in-berlin/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-09T17:53:38+0000",
      "summary": "INDIANAPOLIS - Jonathan Taylor scored an eight-yard touchdown in overtime to lift the Indianapolis Colts to a 31-25 win over the Atlanta Falcons at the Olympic Stadium in Berlin on Sunday. Taylor had a monster day on the ground, gaining 244 yards and scoring three touchdowns as the Colts are now 8-2 and in the [...]"
    },
    {
      "id": "8ffd63d400d99e71",
      "title": "Jonathan Taylor's historic game fuels Colts' thrilling OT win vs. Falcons",
      "link": "https://colts.com/news/jonathan-taylor-s-historic-game-fuels-colts-thrilling-ot-win-vs-falcons",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-09T17:51:57+0000",
      "summary": "Taylor rushed for three touchdowns – including an 83-yarder in the fourth quarter and the game-winner in overtime – to set a new franchise record and propel the Colts to victory."
    },
    {
      "id": "cee5032f76e43f4b",
      "title": "Colts RB Jonathan Taylor scores 65th career rushing touchdown to set new franchise record",
      "link": "https://colts.com/news/colts-jonathan-taylor-scores-65th-career-rushing-touchdown-franchise-record-edgerrin-james-nfl",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-09T17:07:32+0000",
      "summary": "By scoring two rushing touchdowns on Sunday against the Atlanta Falcons, Taylor passed Pro Football Hall of Famer Edgerrin James to set a franchise record with 65 career rushing touchdowns."
    },
    {
      "id": "50e948384144964f",
      "title": "Keys to the Game: Colts vs. Falcons",
      "link": "https://fox59.com/sports/colts/keys-to-the-game-colts-vs-falcons/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-09T14:29:48+0000",
      "summary": ""
    },
    {
      "id": "58596ffdaa1f95ef",
      "title": "Sideline to Sideline: Favorite Vacation Spot",
      "link": "https://fox59.com/sports/colts/sideline-to-sideline-favorite-vacation-spot/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-09T14:22:28+0000",
      "summary": "INDIANAPOLIS - Every week Blue Zone's Chris Widlic asks the Colts one question. This week Chris asks the players what their favorite vacation destination is."
    },
    {
      "id": "b9f72fa4570d72a9",
      "title": "Colts announce 7 inactive players for Week 10 game vs. Atlanta Falcons",
      "link": "https://colts.com/news/colts-announce-7-inactive-players-for-week-10-game-vs-atlanta-falcons",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-09T13:00:54+0000",
      "summary": "The Colts prior to Sunday ruled out defensive ends Samson Ebukam and Tyquan Lewis and wide receive Anthony Gould due to injuries."
    },
    {
      "id": "01ba9c9e07d4e825",
      "title": "How to watch the Atlanta Falcons at Indianapolis Colts on November 9, 2025 in Berlin, Germany",
      "link": "https://colts.com/news/how-to-watch-falcons-at-colts-week-10-2025-berlin-germany",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-09T13:00:00+0000",
      "summary": "TV broadcast, radio and streaming information for Atlanta Falcons at Indianapolis Colts on Sunday, November 9 at 9:30 a.m. ET (Week 10)."
    },
    {
      "id": "bfa08437962c48bb",
      "title": "Colts vs. Falcons in Berlin: What to watch for",
      "link": "https://fox59.com/sports/colts/colts-vs-falcons-in-berlin-what-to-watch-for/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-08T17:37:34+0000",
      "summary": "INDIANAPOLIS – Areas of interest in the Indianapolis Colts’ Sunday meeting with the Atlanta Falcons at Olympic Stadium in Berlin, Germany. History lesson, Part I This is one of those series the Colts have dominated. They own a 15-3 overall advantage. The Falcons won the most recent meeting – 29-10 in 2023 in Atlanta – [...]"
    },
    {
      "id": "9bf724ec2063b6ce",
      "title": "Colts sign WR Laquon Treadwell to 53-man roster from practice squad; elevate DE Durell Nchami, DT Tim Smith to active roster from practice squad for Week 10",
      "link": "https://colts.com/news/colts-sign-laquon-treadwell-53-man-roster-elevate-durell-nchami-tim-smith-deforest-buckner-injured-reserve-falcons-week-10",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-08T14:30:19+0000",
      "summary": "The Colts on Friday announced DT DeForest Buckner (neck) would be placed on injured reserve."
    },
    {
      "id": "adbb893a435dcc9b",
      "title": "Colts’ Reggie Wayne on Adonai Mitchell: I think AD was on track",
      "link": "https://fox59.com/sports/colts/colts-reggie-wayne-on-adonai-mitchell-i-think-ad-was-on-track/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-07T19:20:57+0000",
      "summary": "INDIANAPOLIS – The business side of the NFL delivered a gut-punch to Adonai Mitchell and one of his staunchest supporters. “It sucks,’’ Reggie Wayne said Thursday. The Indianapolis Colts so coveted Sauce Gardner leading up to Tuesday’s trade deadline that they agreed to send the New York Jets two first-round draft picks for their All-Pro [...]"
    },
    {
      "id": "6c5095ea875a320f",
      "title": "Colts place DeForest Buckner on IR",
      "link": "https://fox59.com/sports/colts/colts-place-deforest-buckner-on-ir-2/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-07T17:18:56+0000",
      "summary": "INDIANAPOLIS – The Indianapolis Colts’ defense has been delivered a significant blow. Tackle DeForest Buckner, a franchise cornerstone and interior anchor for Lou Anarumo’s defense, has been placed on the injured reserve list with a neck injury suffered in last Sunday’s loss at Pittsburgh. Coach Shane Steichen made the announcement after putting the Colts through [...]"
    },
    {
      "id": "a9e03717874bf343",
      "title": "Colts rule out DE Samson Ebukam, DE Tyquan Lewis, DT DeForest Buckner for Week 10 game vs. Atlanta Falcons",
      "link": "https://colts.com/news/colts-rule-out-de-samson-ebukam-de-tyquan-lewis-dt-deforest-buckner-for-week-10-game-vs-atlanta-falcons",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-07T17:10:01+0000",
      "summary": "The Colts placed Buckner (neck) on injured reserve on Friday."
    },
    {
      "id": "606ea0d77978fb29",
      "title": "Colts place DT DeForest Buckner on injured reserve",
      "link": "https://colts.com/news/colts-place-dt-deforest-buckner-on-injured-reserve",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-07T17:08:25+0000",
      "summary": "Buckner will miss at least the Colts' next four games."
    },
    {
      "id": "92a94801f194532c",
      "title": "Colts cheerleaders prepare to take entire squad overseas for the first time",
      "link": "https://fox59.com/morning-news/colts-cheerleaders-prepare-to-take-entire-squad-overseas-for-the-first-time/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-07T15:38:00+0000",
      "summary": "INDIANAPOLIS - The Indianapolis Colts are hard at work to keep the momentum of the season going as they touch down in Germany to take on the Atlanta Falcons on Sunday. For the first time, the entire Colts cheerleading squad will travel with the team overseas. When it comes to preparing to travel 4500 miles across the world to [...]"
    },
    {
      "id": "e770e3a5d1631075",
      "title": "Colts locker room reacts to trade for Sauce Gardner: 'If there's any time, the time is now'",
      "link": "https://colts.com/news/colts-locker-room-reacts-sauce-gardner-trade-ownership-belief-playoffs-kenny-moore-zaire-franklin",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-07T15:01:21+0000",
      "summary": "Gardner's arrival brings even more energy and motivation to a team that has been radiating confidence all season."
    },
    {
      "id": "9691e68369a8418e",
      "title": "Colts-Falcons preview: Sauce Gardner, stingy Atlanta defense and a remarkable atmosphere on tap at Olympic Stadium in Berlin",
      "link": "https://colts.com/news/colts-falcons-preview-sauce-gardner-stingy-atlanta-defense-and-a-remarkable-atmosphere-on-tap-at-olympic-stadium-in-berlin",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-07T13:39:42+0000",
      "summary": "The Colts will host the first regular season game held in Berlin on Sunday at Olympic Stadium."
    },
    {
      "id": "42b9e75cc8b9bfb5",
      "title": "Colts & Homefield bring Indiana to Berlin with exclusive fan merchandise",
      "link": "https://colts.com/news/colts-homefield-bring-indiana-to-berlin-with-exclusive-fan-merchandise",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-07T13:20:00+0000",
      "summary": "Available exclusively to Colts fans in Germany in-store at the NFL Shop Berlin"
    },
    {
      "id": "640e05de2b1dbbaf",
      "title": "Sauce Gardner: Trade to Colts ‘great situation’",
      "link": "https://fox59.com/sports/colts/sauce-gardner-trade-to-colts-great-situation/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-06T22:39:00+0000",
      "summary": "INDIANAPOLIS – Hopefully, a chaotic week is eased by eight-plus hours of peace and quiet on a chartered jet. At least, that’s Sauce Gardner’s hope. The All-Pro cornerback described his relocation from the New York Jets to the Indianapolis Colts as “the craziest 48 hours of my life.’’ Monday, Gardner was a $120 million cornerstone [...]"
    },
    {
      "id": "a27e09a94637e8ed",
      "title": "Alec Pierce and Sauce Gardner made each other better as Cincinnati Bearcats. Four years later, they can do the same thing Colts teammates",
      "link": "https://colts.com/news/alec-pierce-sauce-gardner-cincinnati-bearcats-colts-teammates-college-competition-new-york-jets-trade-nfl",
      "source": "Colts.com",
      "feed": "Colts.com",
      "published": "2025-11-06T22:29:23+0000",
      "summary": "Pierce and Gardner's daily competition on Cincinnati's practice field helped them both reach the NFL. Now, reunited as Colts teammates, they can help push each other even more."
    },
    {
      "id": "57baab3555c4af28",
      "title": "Colts rule out DE DeForest Buckner for Falcons game",
      "link": "https://fox59.com/sports/colts/colts-rule-out-de-deforest-buckner-for-falcons-game/",
      "source": "FOX59 / CBS4",
      "feed": "CBS4Indy",
      "published": "2025-11-06T21:21:32+0000",
      "summary": "INDIANAPOLIS – No sooner do the Indianapolis Colts add one top-tier player to their defense than another is ruled out. Tackle DeForest Buckner, the undeniable cornerstone of Lou Anarumo’s defense, has been ruled out and will not make the trip to Berlin for Sunday’s game against the Atlanta Falcons. Buckner suffered a neck injury in [...]"
    }
  ],
  "links": [
    {
      "label": "Schedule",
      "url": "https://www.colts.com/schedule/"
    },
    {
      "label": "Roster",
      "url": "https://www.colts.com/team/players-roster/"
    },
    {
      "label": "Depth Chart",
      "url": "https://www.espn.com/nfl/team/depth/_/name/ind/indianapolis-colts"
    },
    {
      "label": "Injury Report",
      "url": "https://www.colts.com/team/injury-report/"
    },
    {
      "label": "Fan Zone",
      "url": "https://www.colts.com/fans/"
    },
    {
      "label": "Team Shop",
      "url": "https://shop.colts.com/"
    },
    {
      "label": "Tickets",
      "url": "https://www.colts.com/tickets/"
    },
    {
      "label": "Reddit",
      "url": "https://www.reddit.com/r/Colts/"
    },
    {
      "label": "Bleacher Report",
      "url": "https://bleacherreport.com/indianapolis-colts"
    },
    {
      "label": "ESPN Team",
      "url": "https://www.espn.com/nfl/team/_/name/ind/indianapolis-colts"
    },
    {
      "label": "Yahoo Team",
      "url": "https://sports.yahoo.com/nfl/teams/ind/"
    },
    {
      "label": "PFF Team Page",
      "url": "https://www.pff.com/nfl/teams/indianapolis-colts"
    },
    {
      "label": "Pro-Football-Reference",
      "url": "https://www.pro-football-reference.com/teams/clt/"
    },
    {
      "label": "NFL Power Rankings",
      "url": "https://www.nfl.com/news/nfl-power-rankings"
    },
    {
      "label": "Stats",
      "url": "https://www.teamrankings.com/nfl/team/indianapolis-colts"
    },
    {
      "label": "Standings",
      "url": "https://www.nfl.com/standings/league/2025/REG"
    }
  ],
  "sources": [
    "Colts.com",
    "IndyStar",
    "Colts Wire",
    "Stampede Blue",
    "The Athletic",
    "ESPN",
    "Yahoo Sports",
    "Sports Illustrated",
    "CBS Sports",
    "FOX59 / CBS4"
  ]
}